<?php
// Version: 1.4; Drafts

// profile
$txt['drafts_show'] = 'Черновики';
$txt['drafts_show_desc'] = 'Здесь показаны все ваши сохраненные черновики. Вы можете редактировать их или удалить';

// misc
$txt['drafts'] = 'Черновики';
$txt['draft_save'] = 'Сохранить черновик';
$txt['draft_save_note'] = 'Текст сообщения будет сохранен, за исключением вложений, голосований или событий.';
$txt['draft_none'] = 'Черновики отсутствуют.';
$txt['draft_edit'] = 'Редактировать черновик';
$txt['draft_load'] = 'Открыть черновики';
$txt['draft_hide'] = 'Скрыть черновики';
$txt['draft_delete'] = 'Удалить черновик';
$txt['draft_saved_on'] = 'Черновик был сохранен';
$txt['draft_days_ago'] = '%s дней назад';
$txt['draft_retain'] = 'он будет храниться ещё %s дней';
$txt['draft_remove'] = 'Удалить этот черновик';
$txt['draft_saved'] = 'Текст был сохранен как черновик и будет доступен в <a href="%1$s">разделе черновиков</a> вашего профиля.';
$txt['draft_pm_saved'] = 'Текст был сохранен как черновик и будет доступен в <a href="%1$s">разделе черновиков</a> личных сообщений.';
$txt['draft_save_warning'] = 'Обратите внимание: все черновики будут автоматически удалены через %1$d дней.';

// Admin options
$txt['drafts_autosave_enabled'] = 'Включить автоматическое сохранение черновиков';
$txt['drafts_autosave_enabled_subnote'] = 'Черновики сообщений пользователей будут автоматически сохраняться в фоновом режиме с заданной периодичностью. Пользователь должен иметь право доступа к этой возможности.';
$txt['drafts_show_saved_enabled'] = 'Разрешить выбор черновиков при создании сообщений';
$txt['drafts_show_saved_enabled_subnote'] = 'Пользователь сможет выбирать и загружать черновики при создании сообщений. Пользователь должен иметь право доступа к этой возможности.';
$txt['drafts_keep_days'] = 'Количество дней, в течение которых хранить черновики';
$txt['drafts_keep_days_subnote'] = 'Введите 0, чтобы хранить черновики неограниченно долго';
$txt['drafts_autosave_frequency'] = 'Как часто должны сохраняться черновики?';
$txt['drafts_autosave_frequency_subnote'] = 'Минимальное значение — 30 секунд';
$txt['drafts_pm_enabled'] = 'Сохранять черновики личных сообщений';
$txt['drafts_post_enabled'] = 'Сохранять черновики сообщений';
$txt['drafts_none'] = 'Нет темы';
$txt['drafts_saved'] = 'Черновик был сохранен';

?>