<?php
// Version: 1.4; gdpr_agreement

?>Настоящая политика конфиденциальности объясняет характер, объем и цель обработки персональных данных на данном ресурсе.

[b]Адрес владельца форума[/b]
{name}
{street}
{location}
{country}
E-mail: {email}

[b]1. Оператор[/b]
Мы предлагаем несколько услуг, основанных на разных технологиях. Владельцем и оператором веб-сайта является лицо, указанное выше. Запросы на предоставление дополнительной информации можно отправлять по почте на этот адрес или по электронной почте.

[b]1.1 Хостинг[/b]
Сервер для сайта предоставлен:
{hoster}
если не указано иное.

[b]2. Цель собираемых данных[/b]
Обработка ваших персональных данных является частью процедуры обработки вашего запроса. Мы обрабатываем только действительно необходимые данные.

[b]3. Собираемые данные[/b]
При каждом обращении к веб-странице или файлу собираются следующие данные:
[list type=circle][li]запрашиваемая страница или файл[/li]
[li]дата и время запроса[/li]
[li]переданный объем данных[/li]
[li]описание типа веб-браузера и используемой операционной системы[/li]
[li]IP-адрес компьютера-получателя[/li][/list]
Собранная информация хранится в течение 30 дней.

[b]3.1. Куки[/b]
Использование файлов куки может быть отключено в настройках браузера. Обратите внимание, что выключение файлов куки может повлиять на работу веб-сайтов. Куки также могут быть удалены навсегда с помощью используемого браузера. Куки, которые мы используем, предназначены только для обеспечения правильного функционирования веб-сайтов.
Обратите внимание, что мы можем использовать сторонний контент или услуги, которые тоже используют файлы куки. Информацию об этих файлах куки можно найти в политике конфиденциальности сервиса каждого провайдера.

[b]3.2. Регистрация[/b]
При регистрации на нашем веб-сайте ваш адрес электронной почты и выбранное имя будут сохранены. Пароль, введенный во время регистрации, хранится в зашифрованном виде и не может быть расшифрован. Минимальный возраст для регистрации — 16 лет.

[b]3.3. Профили[/b]
При регистрации сохраняются только необходимые данные вашей личности.
В своем профиле на форуме можно ([i]добровольно предоставить дополнительную информацию[/i]) о себе:
[list type=circle][li]персональная картинка (аватар)[/li]
[li]расположение[/li]
[li]дата рождения (чтобы получать поздравительные письма в день рождения)[/li]
[li]пол[/li]
[li]имя пользователя в Skype, Google, Facebook, Twitter или Github[/li]
[li]текст по выбору пользователя в следующих полях:[list type=none]
[li]надпись над аватаром[/li]
[li]подпись под аватаром[/li]
[li]подпись[/li]
[li]имя и ссылка на свой сайт[/li][/list][/li][/list]
Эту информацию можно увидеть (иногда как маленькие изображения) в своем профиле и во всех создаваемых сообщениях.

[b]3.4. Рассылка[/b]
Мы рассылаем электронные уведомления только в том случае, если вы дали согласие на их получение. Этот параметр можно изменить в профиле пользователя. Кроме того, каждая рассылка содержит ссылку для отказа от подписки. В случае нарушения защиты данных или других серьезных сбоев мы имеем право отправлять вам электронные письма без вашего согласия.

[b]3.5. Программное обеспечение[/b]
При каждом запросе или сохранении данных на стороне сервера могут быть предприняты различные действия для чтения, сохранения и обработки данных перед отправкой передачи или ответа на вызывающий компьютер пользователя.
В рамках этих действий сохраняются следующие данные:
[list type=circle][li]идентификатор и логин пользователя[/li]
[li]идентификатор пользовательской сессии[/li]
[li]объем данных, передаваемых от компьютера пользователя до сервера и наоборот[/li]
[li]тип и объем запрашиваемых данных, но не содержимое[/li]
[li]IP-адрес компьютера[/li][/list]
Эти данные предназначены для оптимизации, планирования мощностей, выявления злоупотреблений и возможных ошибок (багов) в [b]PortaMx-Forum[/b]. Вышеуказанные данные будут храниться в течение 30 дней.

[b]4. Услуги хостинга[/b]
Хостинг, который мы используем, предоставляет услуги для размещения информации на сервере, постоянно находящемся в сети, доступ к базе данных и другие, необходимые для полноценной работы этого сайта.

[b]5. Сбор данных доступа и файлы журнала[/b]
Мы, или наш хостер, собираем данные доступа к серверу, а также различные файлы журнала, в соответствии со ст. 6, абз. 1, лит. f Общего регламента по защите данных ЕС.
Данные доступа включают в себя имя запрашиваемой веб-страницы, файл, дату и время запроса, количество передаваемых данных, сообщение об успешном получении, тип и версию браузера, операционную систему пользователя, URL-адрес ссылки (ранее посещенная страница), IP-адрес и запрашивающего поставщика.
Данные журнала хранятся в целях безопасности (например, для расследования злоупотреблений или мошеннических действий) в течение максимум 7 дней, а затем удаляются. Данные, дальнейшее хранение которых требуется для целей доказывания, освобождаются от аннулирования до окончательного выяснения обстоятельств инцидента.

[b]6. Интеграция сервисов и контента третьих сторон[/b]
Мы используем сторонний контент или предложения дополнительных услуг в рамках нашего сайта, основываясь на законных интересах пользователей, для интеграции контента и услуг. Это всегда предполагает, что сторонние сервисы получают IP-адрес пользователей, так как иначе они не могут отправить запрашиваемую информацию. Поэтому IP-адрес необходим для представления этого содержимого.

[b]6.1. PayPal[/b]
На нашем сайте мы интегрировали компоненты от PayPal, которые автоматически передают данные заинтересованного лица PayPal. При выборе субъект данных дает согласие на передачу персональных данных, необходимых для обработки платежа. Личные данные, которые передаются PayPal: имя, фамилия, адрес, адрес электронной почты, IP-адрес, номер телефона, номер мобильного телефона или другие данные, необходимые для обработки платежей.
Для исполнения договора купли-продажи необходимы также персональные данные, которые относятся к соответствующему заказу. Личные данные, которыми обмениваются PayPal и контроллер, могут быть переданы PayPal агентствам кредитной отчётности. Эта передача направлена на проверку личности и кредита. Субъект данных имеет возможность в любое время отозвать согласие на обработку персональных данных в отношении PayPal. Отзыв не влияет на персональные данные, которые должны быть обработаны, использованы или переданы для (договорной) обработки платежей.
PayPal может раскрывать личную информацию аффилированным лицам и поставщикам услуг или субподрядчикам в объеме, необходимом для выполнения своих договорных обязательств или для обработки данных от имени.
Связаться с официальным представителем PayPal по вопросам защиты данных можно по адресу: ООО НКО «ПэйПал РУ» Россия, 125047, Москва, ул. Бутырский Вал, д. 10.
Политика конфиденциальности: [url=https://www.paypal.com/uk/webapps/mpp/ua/privacy-full]https://www.paypal.com/uk/webapps/mpp/ua/privacy-full[/url].

[b]6.2. Youtube[/b]
Мы внедряем ролики с платформы YouTube, принадлежащей Google LLC, 1600 Amphitheater Parkway, Mountain View, CA 94043, USA.
Политика конфиденциальности: [url=https://www.google.com/policies/privacy]https://www.google.com/policies/privacy[/url].

[b]6.3. Google ReCaptcha[/b]
Мы используем рекапчу для обнаружения ботов, например, при регистрации и отправке различных форм. Сервис рекапчи предоставлен Google LLC, 1600 Amphitheater Parkway, Mountain View, CA 94043, USA.
Политика конфиденциальности: [url=https://www.google.com/policies/privacy]https://www.google.com/policies/privacy[/url].

[b]6.4. Данные о местоположении[/b]
Геолокация — это определение географического местоположения компьютера, подключенного к Интернету. Мы не храним эти данные, но используем их в статистических целях, чтобы распознавать поисковые системы и определять, какой язык вы обычно используете. Чтобы определить географическое положение компьютера (континент и страну), Ваш IP-адрес будет отправлен в службу geoPlugin по защищенному соединению (SSL).
Политика конфиденциальности: [url=https://www.geoplugin.com/privacy]https://www.geoplugin.com/privacy[/url].

[b]7. Доступ и право пользования[/b]
Полные права на сайт принадлежат оператору. Учетные записи могут использоваться только владельцем. Кроме того, владелец учетной записи несет ответственность за защиту от неправильного использования.

[b]7.1. Ответственность[/b]
Любой контент, нарушающий действующее законодательство, как правило, нежелателен. Это относится к оскорблениям/клевете, а также к программному обеспечению, распространяемому незаконно. Если вы заметили какой-либо незаконный контент, пожалуйста, немедленно свяжитесь с администрацией. Также нежелательна коммерческая реклама без предварительной консультации с оператором форума.

[b]7.2. Отказ от ответственности[/b]
Оператор форума оставляет за собой право не отвечать за актуальность, правильность, полноту или качество предоставленной информации. Требования к ответственности перед оператором, относящиеся к материальному или нематериальному характеру, вызванные использованием или неиспользованием предоставленной информации или использованием неправильной и неполной информации, исключаются. Оператор оставляет за собой право изменять или удалять отдельные вклады, части страниц или все предложения без предварительного уведомления или прекращать публикацию временно или постоянно.

[b]7.3. Авторские права[/b]
Публикуя тему, оператор получает неограниченное право использования. В случае выхода из форума, нет права на отмену любой темы. Если содержание темы позволяет получить явную личную ссылку на автора, может потребоваться её удаление или анонимность. Тем не менее, только имя пользователя не содержит личной ссылки на автора.

[b]7.4. Удаление пользователя[/b]
Авторизованные пользователи могут запросить удаление своих данных либо в своем профиле пользователя, либо по электронной почте, либо письменно (с именем пользователя, электронной почтой и паролем). Мы прямо указываем, что в этом случае исполнение контракта со стороны оператора становится невозможным, и нет права на возмещение, компенсацию или погашение любых уже произведенных нами платежей.

[b]7.5. Получение ваших данных[/b]
Авторизованные пользователи могут получить свои сохраненные данные (профиль и сообщения) в своем профиле пользователя и загрузить их на ПК. Упоминания и значения в кавычках (имя, время и ссылка) в сообщениях (насколько это технически возможно) удаляются. Эти данные предоставляются в формате CSV.
