<?php
// Version: 1.3; Help

global $helptxt;

$txt['close_window'] = 'Закрыть окно';
$txt['agreement_disabled'] = 'Регистрационное соглашение отключено';

$helptxt['manage_boards'] = '
	<strong>Редактирование разделов</strong><br>
	В этом меню можно создавать/перемещать/удалять категории и разделы, содержащиеся в них.
	К примеру, если у вас большой сайт, посвященный &quot;Спорту&quot;, &quot;Машинам&quot; и &quot;Музыке&quot;,
	то почти наверняка <em>Категориями</em> верхнего уровня будут категории именно с подобными названиями.
	В каждой из этих категорий можно создать &quot;подкатегории&quot; или &quot;разделы&quot;.
	Это простая иерархия, со следующей структурой: <br>
	<ul class="normallist">
		<li>
			<strong>Спорт</strong>
			&nbsp;- &quot;Категория&quot;
			<ul class="normallist">
				<li>
					<strong>Бейсбол</strong>
					&nbsp;- Раздел внутри категории &quot;Спорт&quot;
					<ul class="normallist">
						<li>
							<strong>Статистика</strong>
							&nbsp;- Подраздел раздела &quot;Бейсбол&quot;
						</li>
					</ul>
				</li>
				<li><strong>Футбол</strong>
				&nbsp;- Раздел внутри категории &quot;Спорт&quot;</li>
			</ul>
		</li>
	</ul>
	Категории позволяют разделить форум на основные темы (&quot;Автомобили&quot;, &quot;Спорт&quot;) и &quot;Разделы&quot;,
	в каждом из которых пользователи могут оставлять сообщения на соответствующую тему.	К примеру, пользователь, интересующийся
	автомобилями марки &quot;Пинто&quot;, наверняка захочет оставить несколько сообщений в разделе &quot;Автомобили->Пинто&quot;.
	Иерархическая структура позволяет людям быстрее найти то, что их интересует.
	Раздел является ключевой темой, содержащей в себе другие по одной и той же тематике.
	Функции, доступные на этой странице, позволяют создавать новые разделы внутри каждой категории, изменять их, менять порядок, а также полностью удалять.';

$helptxt['edit_news'] = '
	<ul class="normallist">
		<li>
			<strong>Новости</strong><br>
			В этой секции можно настроить текст новостей, отображаемых на главной странице форума.
			Добавьте желаемый пункт (например, &quot;Не пропустите собрание во вторник!&quot;) и сохраните изменения. Новости будут отображаться в случайном порядке, по одной за раз.
		</li>
		<li>
			<strong>Рассылки</strong><br>
			В этой секции можно отправлять специальные сообщения пользователям форума, через личные сообщения или по электронной почте. Для начала отметьте группы, которым хотите разослать сообщения. Кроме того, можно указать дополнительных адресатов. Затем введите текст сообщения и выберите тип рассылки: с помощью ЛС или же через электронную почту.
		</li>
		<li>
			<strong>Настройки</strong><br>
			В этой секции содержится несколько настроек, относящихся к новостям и рассылкам, включая выбор групп, которые могут редактировать новости форума или отправлять информационные сообщения по почте. Доступны также параметр для включения/отключения новостной ленты форума и параметр для управления длиной сообщений в RSS-ленте.
		</li>
	</ul>';

$helptxt['view_members'] = '
	<ul class="normallist">
		<li>
			<strong>Просмотр всех пользователей</strong><br>
			Просмотр всех пользователей форума.
			Вам представляется список имен пользователей со ссылками.
			Можно кликнуть на любое из имен для просмотра дополнительных сведений (домашняя страница, возраст,&nbsp;и&nbsp;т.&nbsp;д.) или их изменения.
			У вас полный контроль над пользователями, включая возможность их удаления с форума.<br><br>
		</li>
		<li>
			<strong>Ожидание подтверждения</strong><br>
			Эта секция доступна только при включении подтверждения администратором новых регистраций.
			Любой, кто регистрируется на вашем форуме, станет полноценным пользователем, но только после того как его кандидатура будет одобрена администратором.
			Этот раздел показывает список всех тех пользователей, которые ожидают одобрения, вместе с их электронными и IP-адресами.
			Вы в любой момент можете разрешить или отклонить (удалить) любого пользователя в списке, отметив галочкой поле напротив пользователя и выбрав нужное действие из выпадающего меню в нижней части экрана.
			При отклонении (удалении) пользователя его можно уведомить об этом.<br><br>
		</li>
		<li>
			<strong>Ожидание активации</strong><br>
			Эта секция доступна только при включении режима активации учётных записей.
			Здесь отображается список всех пользователей, которые пока не активировали свой аккаунт.
			В этом разделе можно разрешить, отклонить или напомнить пользователям о необходимости завершить процесс регистрации.
			Кроме того, можно уведомить пользователя о совершенных вами действиях.<br><br>
		</li>
	</ul>';

$helptxt['ban_members'] = '<strong>Бан пользователей</strong><br>
	PortaMx Forum предоставляет возможность «банить» конкретных пользователей, чтобы не допускать к общению на форуме тех, кто нарушил правила.
	Можно выбрать тех пользователей, которых не хочется видеть на форуме. Вам, как администратору, при просмотре доступны IP-адреса всех пользователей.
	В списке ниже нужно просто указать конкретный IP и сохранить его, после чего пользователи, использующие этот адрес, больше не смогут оставлять с него сообщения.<br>Кроме того, можно забанить пользователей по их электронным адресам.';

$helptxt['featuresettings'] = '<strong>Свойства и параметры</strong><br>
	Здесь можно изменить некоторые настройки форума, в соответствии со своими предпочтениями.';

$helptxt['modsettings'] = '<strong>Изменение настроек модификаций</strong><br>
	В этой секции содержатся настройки, добавленные установленными модификациями.';

$helptxt['live_news'] = '<strong>Последние новости</strong><br>
	В этом блоке отображаются последние обновленные новости с <a href="http://www.portamx.com/" target="_blank" class="new_win">www.portamx.com</a>.
	Просматривайте их время от времени для получения информации об обновлениях, новых релизах, и важной информации от Simple Machines.';

$helptxt['registrations'] = '<strong>Управление регистрацией</strong><br>
	Этот раздел содержит все функции, которые могут быть необходимыми для управления новыми регистрациями на форуме. Содержит до четырех
	разделов, которые видны в зависимости от настроек форума. Среди них:<br><br>
	<ul class="normallist">
		<li>
			<strong>Регистрация нового пользователя</strong><br>
			Здесь можно зарегистрировать нового пользователя. Это может быть полезно на тех форумах, где регистрация закрыта
			для новых пользователей, или в случаях, когда администратор хочет создать тестовую учётную запись. Если выбрана опция «требовать активацию учётной записи», пользователю будет отправлено электронное сообщение со ссылкой для активации, по которой он должен будет перейти, прежде чем сможет использовать учётную запись. Также можно использовать отправку нового пароля на заданные электронные адреса.<br><br>
		</li>
		<li>
			<strong>Регистрационное соглашение</strong><br>
			Это позволяет задать текст для регистрационного соглашения, отображаемого при регистрации на форуме.<br><br>
		</li>
		<li>
			<strong>Зарезервированные имена</strong><br>
			Используя этот интерфейс, можно указать слова или имена, которые нельзя будет использовать в именах пользователей.<br><br>
		</li>
		<li>
			<strong>Настройки</strong><br>
			Этот раздел будет виден только при наличии прав администрирования. Здесь можно выбрать метод регистрации,
			используемый на форуме, а также другие настройки, относящиеся к регистрации.
		</li>
	</ul>';

$helptxt['modlog'] = '<strong>Журнал модерации</strong><br>
	Этот раздел позволяет модераторам отслеживать все действия по модерированию, совершённые модераторами форума. Очистка журнала также отслеживается.';
$helptxt['adminlog'] = '<strong>Журнал администрирования</strong ><br>
	Этот раздел позволяет администраторам отслеживать некоторые административные действия, произведенные на форуме. Очистка журнала также отслеживается.';
$helptxt['userlog'] = '<strong>Журнал редактирования профилей</strong><br>
	Этот раздел позволяет администраторам просматривать изменения, сделанные пользователями в своих профилях.';
$helptxt['warning_enable'] = '<strong>Система предупреждений пользователей</strong><br>
	Эта функция позволяет администраторам и модераторам выносить пользователям предупреждения различного уровня. От этого уровня будут зависеть права пользователей на те или иные действия.';
$helptxt['warning_watch'] = 'Этот параметр определяет процентный уровень предупреждения, при достижении которого пользователь автоматически попадает в список &quot;наблюдаемых&quot;. Все &quot;наблюдаемые&quot; пользователи отображаются в центре модерации.';
$helptxt['warning_moderate'] = 'Любой пользователь с подобным статусом будет вынужден ждать модерации своих сообщений, прежде чем они появятся на форуме. Это переопределит любые локальные права разделов, так или иначе связанные с модерацией сообщений.';
$helptxt['warning_mute'] = 'Любой пользователь с подобным статусом не сможет ничего написать на форуме, так как лишается прав на постинг.';
$helptxt['user_limit'] = 'Эта настройка ограничивает количество баллов, которые модератор может добавить/удалить конкретному пользователю в течение 24 часов. Используется для ограничения действий модератора за небольшой промежуток времени. Отключается установкой нулевого значения. Примечание: не влияет на пользователей с правами администраторов.';

$helptxt['error_log'] = '<strong>Журнал ошибок</strong><br>
	Здесь отображаются все ошибки, с которыми столкнулись пользователи при использовании форума. Ошибки сортируются по дате, можно выбрать сортировку, кликнув по черной стрелке напротив каждой даты. Кроме того, можно отфильтровать ошибки, кликнув по изображению рядом с каждой ошибкой. Это позволяет фильтровать ошибки, к примеру, по пользователям. Когда фильтр включен, будут показаны только те результаты, которые соответствуют данному фильтру.';
$helptxt['theme_settings'] = '<strong>Настройки тем оформления</strong><br>
	Этот раздел позволяет изменять настройки, относящиеся к теме оформления. Эти настройки включают такие параметры, как директория тем и URL-адреса, а также параметры, влияющие на отображение темы на вашем форуме. Большинство тем будут иметь различные параметры, настраиваемые пользователем, позволяющие адаптировать тему в соответствии с индивидуальными предпочтениями.';

$helptxt['smileys'] = '<strong>Смайлы и иконки</strong><br>
	Здесь можно добавлять, удалять смайлы, или наборы смайлов. Заметьте, что если смайл один в наборе, то он появляется во всех наборах &mdash; иначе он может смутить ваших пользователей, использующих разные наборы.<br><br>
	Вы также можете отредактировать иконки сообщений, если это разрешено на странице настроек.';
$helptxt['calendar'] = '<strong>Управление календарем</strong><br>
	Здесь можно изменить текущие настройки календаря, добавить или удалить праздники.';
$helptxt['cal_export'] = 'Экспорт в текстовый файл в формате iCal для импорта в другие программы';
$helptxt['cal_highlight_events'] = 'Этот параметр позволяет выделить события в мини-календарях и/или главном календаре.';
$helptxt['cal_highlight_holidays'] = 'Этот параметр позволяет выделить праздники в мини-календарях и/или главном календаре.';
$helptxt['cal_highlight_birthdays'] = 'Этот параметр позволяет выделить дни рождения в мини-календарях и/или главном календаре.';
$helptxt['cal_disable_prev_next'] = 'Если этот параметр включен, блоки с тремя месяцами в левой части страницы будут отключены.';
$helptxt['cal_display_type'] = 'Этот параметр позволяет изменить тип отображения календаря.<br><br><strong>Удобный:</strong> делает ячейки календаря большими.<br><strong>Компактный:</strong> делает ячейки календаря маленькими.';
$helptxt['cal_week_links'] = 'Если этот параметр включен, ссылки будут добавляться рядом с каждой неделей в календаре.';
$helptxt['cal_prev_next_links'] = 'Если этот параметр включен, ссылки на предыдущий месяц и следующий месяц будут добавляться в начало каждого месяца для удобства навигации.';
$helptxt['cal_short_months'] = 'Если этот параметр включен, имена месяцев в календаре будут сокращены.<br><br><strong>Включено:</strong> ' . $txt['months_short'][1] . ' 1<br><strong>Выкючено:</strong> ' . $txt['months_titles'][1] . ' 1';
$helptxt['cal_short_days'] = 'Если этот параметр включен, имена дней в календаре будут сокращены.<br><br><strong>Включено:</strong> ' . $txt['days_short'][1] . '<br><strong>Выключено:</strong> ' . $txt['days'][1];

$helptxt['serversettings'] = '<strong>Настройки сервера</strong><br>
	Здесь можно изменять основные настройки форума. Этот раздел включает в себя настройки базы данных и URL-адресов, а также настройки отсылки сообщений и кэширование. Прежде чем изменять данные настройки, хорошенько подумайте, потому как неправильная настройка может привести форум в нерабочее состояние.';
$helptxt['manage_files'] = '
	<ul class="normallist">
		<li>
			<strong>Просмотр файлов</strong><br>
			Просмотр всех вложений, аватаров и эскизов, сохраненных PortaMx Forum.<br><br>
		</li><li>
			<strong>Свойства вложений</strong><br>
			Конфигурация директорий для хранения вложений, а также установка ограничений на типы вложений.<br><br>
		</li><li>
			<strong>Свойства аватаров</strong><br>
			Конфигурация директорий для хранения аватаров, а также управление изменением размеров аватаров.<br><br>
		</li><li>
			<strong>Обслуживание файлов</strong><br>
			Проверка и исправление любых ошибок в директории вложений, а также удаление выбранных вложений.<br><br>
		</li>
	</ul>';

$helptxt['topicSummaryPosts'] = 'Это позволяет устанавливать число предыдущих сообщений, отображаемых под краткой сводкой темы в окне ответа.';
$helptxt['enableAllMessages'] = 'Установите здесь <em>максимальное</em> число сообщений в теме, которые будут показаны по ссылке &quot;все&quot;.';

$helptxt['allow_guestAccess'] = 'Убрав здесь галочку, можно запретить гостям делать что-либо, кроме базовых функций: вход, регистрация, напоминание пароля и пр. Это не то же самое, что запрет доступа гостям к форуму.';
$helptxt['userLanguage'] = 'Включение этого параметра позволит пользователям выбирать, какой языковой файл они будут использовать. Это не повлияет на выбор по умолчанию.';
$helptxt['errorLanguage'] = 'Выберите язык, который будет использоваться для зарегистрированных ошибок. Наилучший выбор — выбрать язык, понятный администратору.';

$helptxt['trackStats'] = 'Статистика:<br>Это разрешит пользователям видеть последние сообщения и наиболее популярные темы на форуме. Также это показывает некоторую статистику, такую как наибольшее количество пользователей онлайн, новые пользователи и новые темы.<hr>Просмотры страницы:<br>Добавляет ещё одну колонку в страницу статистики, на которой отображается число просмотров страниц форума.';
$helptxt['titlesEnable'] = 'Включение надписи над аватаром, позволит пользователям с соответствующими правами создавать специальные названия для себя. Это будет отображаться под именем.<br><em>Например:</em><br>Bugo<br>Переводчик';
$helptxt['onlineEnable'] = 'Это будет отображать картинку, показывающую текущий статус пользователя.';
$helptxt['todayMod'] = 'Это отобразит «Сегодня», «Завтра» или относительное время вместо даты.<br><br>
		<strong>Примеры:</strong><br><br>
		<ul class="normallist">
			<li>
			<strong>Отключено</strong><br>
			3 октября 2009 в 00:59:18</li>
			<li><strong>Только Сегодня</strong><br>
			Сегодня в 12:59:18</li>
			<li><strong>Сегодня &amp; Вчера</strong><br>
			Вчера в 21:36:55</li>
			<li><strong>Относительные дата &amp; время</strong><br>
			6 часов назад</li>
		</ul>';
$helptxt['disableCustomPerPage'] = 'Отметьте эту опцию, чтобы запретить пользователям индивидуальную настройку количества выводимых сообщений и тем на одной странице.';
$helptxt['enablePreviousNext'] = 'Отображение ссылок на следующую и предыдущую темы.';
$helptxt['pollMode'] = 'Это определяет, включены голосования или нет. Если голосования отключены, все существующие голосования будут скрыты из списка тем. Можно установить отображение обычных тем без голосований, выбрав вариант «Показывать существующие голосования как темы».<br><br>Для выбора	тех, кто может создавать, просматривать и участвовать в голосованиях, можно настроить соответствующие права доступа.';
$helptxt['enableCompressedOutput'] = 'Эта установка будет сжимать страницы для снижения загрузки канала, но для этого необходима установленная библиотека zlib.';
$helptxt['disableTemplateEval'] = 'По умолчанию шаблоны высчитываются (evaluated) вместо обычного включения (include) в код форума. Это необходимо для отображения более полной полезной отладочной информации в случае, если шаблон содержит ошибки.<br><br>Однако на больших форумах включение данной функции может привести к общему снижению производительности. Поэтому опытные пользователи могут это отключить.';
$helptxt['httponlyCookies'] = 'Куки не будут доступны для языков типа JavaScript. Эта настройка может помочь уменьшить кражу персональных данных с помощью XSS-атак. А также привести к проблемам с другими скриптами, используемыми на сайте.';
$helptxt['databaseSession_enable'] = 'Эта опция делает возможным использование базы данных для хранения сессий &mdash; это лучше для серверов со сбалансированной нагрузкой, устраняет все ошибки с таймаутами и может сделать работу вашего форума быстрее.';
$helptxt['databaseSession_loose'] = 'Включение уменьшит загрузку канала, используемую форумом, и сделает так, что при клике назад страница не будет перезагружаться &mdash; недостаток этого в том что (новые) иконки не обновятся, так же как и другие вещи.';
$helptxt['databaseSession_lifetime'] = 'Продолжительность сессии (в секундах) после последней активности. Рекомендованное значение &mdash; более 2400.';
$helptxt['tfa_mode'] = 'Вы можете добавить второй уровень безопасности на свой форум, включив <a href="https://ru.wikipedia.org/wiki/Многофакторная_аутентификация#%D0%94%D0%B2%D1%83%D1%85%D1%84%D0%B0%D0%BA%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F_%D0%B0%D1%83%D1%82%D0%B5%D0%BD%D1%82%D0%B8%D1%84%D0%B8%D0%BA%D0%B0%D1%86%D0%B8%D1%8F">двухфакторную аутентификацию</a>. Она заставляет пользователей вводить генерируемый программой код подтверждения после обычной авторизации. Вам нужно настроить двухфакторную авторизацию себе, прежде чем предлагать другим пользователям переходить на нее!';
$helptxt['cache_enable'] = 'PortaMx Forum использует различные варианты кэширования. Чем более высокий уровень кэширования используется, тем больше времени используется процессором для извлечения кэшированной информации. Если кэширование доступно, попробуйте для начала 1 уровень.';
$helptxt['cache_memcache'] = 'При использовании memcache необходимо предоставить настройки сервера. Можно указать несколько серверов, через запятую, как в примере ниже:<br><br>	&quot;server1,server2,server3:port,server4&quot;<br><br>Обратите внимание: если не указать порт, PortaMx Forum будет использовать порт 11211. Если хост содержит слэш, порт будет установлен на 0. PortaMx Forum попытается выполнить грубую/случайную балансировку нагрузки на указанных серверах.';
$helptxt['cache_cachedir'] = 'Этот параметр используется только при файловом кэшировании. Он указывает путь к каталогу кэша.';
$helptxt['enableErrorLogging'] = 'Запись любых ошибок, таких как неправильный вход, так что можно будет просмотреть, что именно происходило неправильно.';
$helptxt['enableErrorQueryLogging'] = 'В журнал ошибок будет включен полный текст запроса, отправленного к базе данных. Регистрация ошибок должна быть включена.<br><br><strong>Примечание:  Это повлияет на возможность фильтрации ошибок в журнале по сообщениям.</strong>';
$helptxt['log_ban_hits'] = 'Если включено, каждый раз, когда забаненный пользователь пытается получить доступ к сайту, в журнале ошибок будет появляться соответствующая запись. Если эта информация вам не нужна, отключите данный параметр, для повышения быстродействия.';
$helptxt['allow_disableAnnounce'] = 'Это разрешит пользователям не получать уведомления о темах.';
$helptxt['disallow_sendBody'] = 'Эта настройка убирает возможность получать текст ответов и сообщений в письмах уведомлений.<br><br>Часто пользователи могут отвечать на письма уведомлений, что в большинстве случаев означает то, что этот ответ получает веб-мастер.';
$helptxt['enable_ajax_alerts'] = 'Этот параметр позволяет пользователям получать AJAX-уведомления. Это означает, что пользователям не придется обновлять страницу для получения новых уведомлений.<br><strong>ПРИМЕЧАНИЕ:</strong> Этот параметр может привести к серьезной нагрузке на сервере с большим количеством пользователей онлайн.';
$helptxt['jquery_source'] = 'Это определит источник, используемый для загрузки библиотеки jQuery. <em>Автоматически</em> сначала будет использоваться CDN, а в случае неудачи будет производиться подключение файла из локальной директории. <em>Локальный источник</em> будет использоваться загрузка из директории форума. <em>CDN</em> загрузка с серверов Google CDN';
$helptxt['compactTopicPagesEnable'] = 'Эта опция задает количество отображаемых номеров страниц.<br><em>Пример: </em>
		&quot;3&quot; для отображения в виде: 1 ... 4 [5] 6 ... 9 <br>
		&quot;5&quot; для отображения в виде: 1 ... 3 4 [5] 6 7 ... 9';
$helptxt['timeLoadPageEnable'] = 'Отображение в нижней части форума времени в секундах, которое понадобилось для генерации конкретной страницы.';
$helptxt['showCacheStatus'] = 'Отобразит статус кэширования (загрузку, размер и время в миллисекундах) для текущей страницы в нижней части форума, если кэширование включено. <br>Как админу, вам доступен <em>быстрый сброс кэша</em> — достаточно нажать на ссылку <strong>Кэш</strong>.';
$helptxt['removeNestedQuotes'] = 'При включении этой опции из сообщений будут удаляться вложенные цитаты (вместо них останутся ссылки).';
$helptxt['max_image_width'] = 'Это позволяет задать максимальный размер для размещаемых картинок.';
$helptxt['mail_type'] = 'Эта настройка позволяет выбрать установки PHP по умолчанию, или задать свои настройки SMTP. PHP не поддерживает SMTP-аутентификацию, так что, если это нужно, выберите SMTP. Но помните, что SMTP может работать медленнее, и некоторые сервера не будут принимать имя пользователя и пароль.<br><br>Вам не придется заполнять настройки SMTP, если установлены настройки PHP по умолчанию.<br>Для использования шифрования указывайте сервер SMTP так ssl://адрес_сервера.';
$helptxt['attachment_manager_settings'] = 'Вложения &mdash; это файлы, которые пользователи могут загружать на форум и прикреплять к своим сообщениям (для последующего просмотра/скачивания другими пользователями).';
$helptxt['attachmentCheckExtensions'] = 'Для некоторых сообществ иногда требуется ограничить загрузку определенных типов файлов.';
$helptxt['attachmentExtensions'] = 'Если опция «проверять расширения вложений» активна, можно будет добавлять к сообщениям вложения только указанных форматов.';
$helptxt['attachmentUploadDir'] = 'Путь к папке вложений на сервере<br>(пример: /home/sites/yoursite/www/forum/attachments)';
$helptxt['attachmentDirSizeLimit'] = ' Выберите размер папки вложений, включая размер всех файлов внутри нее.';
$helptxt['attachmentPostLimit'] = ' Выберите максимальный размер файла (в КБ) для всех вложений в сообщении.';
$helptxt['attachmentSizeLimit'] = 'Выберите максимальный размер файла для каждого отдельного вложения.';
$helptxt['attachmentNumPerPostLimit'] = ' Выберите количество вложений, которое пользователь может использовать в одном сообщении.';
$helptxt['attachmentShowImages'] = 'Если загруженный файл является изображением, он будет отображаться под сообщением.';
$helptxt['attachmentThumbnails'] = 'Если выбрана вышеуказанная настройка, это сохранит отдельное (меньшее) вложение для миниатюры, чтобы уменьшить пропускную способность.';
$helptxt['attachmentThumbWidth'] = 'Используется только с параметром «Изменять размер изображений при отображении под сообщениями» — установка максимальной ширины для изменения размера вложений. Они будут изменены пропорционально.';
$helptxt['attachmentThumbHeight'] = 'Используется только с параметром «Изменять размер изображений при отображении под сообщениями» — установка максимальной высоты для изменения размера вложений. Они будут изменены пропорционально.';
$helptxt['attachmentDirFileLimit'] = 'Максимальное количество файлов в директории';
$helptxt['attachmentEnable'] = 'Этот параметр позволяет настроить способ создания вложений.<br><br>
	<ul class="normallist">
		<li>
			<strong>Отключить все вложения</strong><br>
			Все вложения отключены. Существующие вложения не удаляются, но скрыты от просмотра (их не видят даже администраторы). Новые вложения также не могут быть сделаны, независимо от разрешений.<br><br>
		</li>
		<li>
			<strong>Включить все вложения</strong><br>
			Обычное состояние: пользователи работают с вложениями в соответствии с выставленными правами доступа.<br><br>
		</li>
		<li>
			<strong>Отключить новые вложения</strong><br>
			Существующие вложения по-прежнему доступны, но новые вложения не могут быть добавлены, независимо от разрешения.
		</li>
	</ul>';
$helptxt['attachment_image_paranoid'] = 'При выборе этой опции будет включена очень строгая проверка вложенных изображений. <strong>Предупреждение:</strong> Эту проверку могут не пройти и нормальные изображения. Поэтому настоятельно рекомендуется использовать данную опцию только совместно с обработкой изображений, чтобы в случае необходимости могла произойти повторная выборка изображений, не прошедших проверку безопасности. После прохождения проверки такие изображения будут подчищены и загружены. В противном случае, если обработка изображений не включена, любые вложения, провалившие проверку безопасности, будут отклонены.';
$helptxt['attachment_image_reencode'] = 'При выборе этой опции будет производиться попытка перекодирования загружаемых вложений, для обеспечения более высокой безопасности. Обратите внимание: после перекодирования все анимированные изображения станут статичными. <br> Данная функция работает только при наличии установленного GD-модуля на сервере. ';
$helptxt['attachment_thumb_memory'] = 'Чем больше исходное изображение (размер & ширина x высота), тем выше требования к памяти сервера для успешного создания миниатюр.<br>Проверяя этот параметр, система оценит необходимый объем памяти и запросит его. В случае успеха будет произведена попытка создать эскиз.<br>Это приведет к меньшему количеству ошибок, но может привести и к созданию меньшего количества эскизов. Если этот флажок не установлен, система всегда будет пытаться создать эскиз (с фиксированным объемом памяти). Это может привести к большему количеству ошибок.';
$helptxt['attachmentRecodeLineEndings'] = 'Скрипт обработает символы конца строки в соответствии с настройками сервера.';
$helptxt['automanage_attachments'] = 'По умолчанию PortaMx Forum помещает новые вложения в одну папку. Для большинства сайтов это не проблема, но по мере роста сайта может быть полезно иметь несколько папок для хранения вложений.<br><br>Этот параметр позволяет указать, следует ли управлять этими папками самостоятельно (например, создание второй папки и перемещение в нее по готовности) или поручить эти операции движку, на основе критериев (например, когда текущий каталог достигает заданного размера), или разбивка папок по годам или даже месяцам на очень загруженных сайтах.';
$helptxt['dont_show_attach_under_post'] = 'Если включено, вложения в сообщении не будут отображаться и подлежат удалению.';
$helptxt['use_subdirectories_for_attachments'] = 'Создать новые директории.';
$helptxt['max_image_height'] = 'Как и в случае с максимальной шириной, этот параметр указывает максимальную высоту размещенного изображения.';
$helptxt['avatar_paranoid'] = 'При выборе этой опции будет включена очень строгая проверка аватаров. Предупреждение! Эту проверку могут не пройти и нормальные изображения. Поэтому настоятельно рекомендуется использовать данную опцию только совместно с обработкой аватаров, чтобы в случае необходимости могла произойти повторная выборка изображений, не прошедших проверку безопасности. После прохождения проверки такие изображения будут подчищены и загружены. В противном случае, если обработка аватаров не включена, любые аватары, провалившие проверку безопасности, будут отклонены.';
$helptxt['avatar_reencode'] = 'При выборе этой опции будет производиться попытка перекодирования загружаемых аватаров, для обеспечения более высокой безопасности. Обратите внимание: после перекодирования все анимированные изображения станут статичными. <br> Данная функция работает только при наличии установленного GD-модуля на сервере.';
$helptxt['cal_enabled'] = 'Календарь может быть использован для отображения дней рождений или важных событий, происходящих в вашем сообществе.<br><br>
	<strong>Показывать дни как ссылку на \'Добавить событие\'</strong>:<br>Это разрешит пользователям добавлять события в тот день, когда они кликнут по этой дате<br>
	<strong>Показывать номера недели</strong>:<br>Показывать сведения о текущей неделе.<br>
	<strong>Максимально дней в анонсе на главной странице форума</strong>:<br>Если установлено 7, будут показаны лучшие из событий следующей недели.<br>
	<strong>Показывать праздники на главной странице форума</strong>:<br>Показывать сегодняшние праздники в блоке событий на главной странице форума.<br>
	<strong>Показывать дни рождения на главной странице форума</strong>:<br>Показывать сегодняшние дни рождения в блоке календарь на главной странице форума.<br>
	<strong>Показывать события на главной странице форума</strong>:<br>Показывать сегодняшние события в блоке календарь на главной странице форума.<br>
	<strong>Форум по умолчанию для размещения сообщений</strong>:<br>В каком форуме по умолчанию размещать события?<br>
	<strong>Разрешать события не ссылающиеся на сообщения</strong>:<br>Разрешить пользователям размещать события без необходимости создания ссылки на них на форуме.<br>
	<strong>Минимальный год</strong>:<br>Выберите &quot;первый&quot; год в списке календаря<br>
	<strong>Максимальный год</strong>:<br>Выберите &quot;последний&quot; год в списке календаря<br>
	<strong>Цвет дня рождения</strong>:<br>Выберите цвет для текста дня рождения<br>
	<strong>Цвет события</strong>:<br>Выберите цвет для текста события<br>
	<strong>Цвет праздника</strong>:<br>Выберите цвет текста для праздника<br>
	<strong>Разрешить занимать событиям несколько дней</strong>:<br>Отметьте, чтобы разрешить событиям распределяться на несколько дней.<br>
	<strong>Максимальное количество дней для события</strong>:<br>Выберите максимальное количество дней, которое может занимать событие.<br><br>
	Помните, что использование календаря (размещение, просмотр событий и пр.) управляется правами доступа.';
$helptxt['localCookies'] = 'PortaMx Forum использует куки-файлы, чтобы хранить информацию об учётной записи на компьютере клиента.
	Эти файлы могут храниться глобально (myserver.com) или локально (myserver.com/путь/к/форума).<br>
	Отметьте эту опцию, если испытываете проблемы с пользователями, которых автоматически выкидывает с форума.<hr>
	Хранящиеся глобально куки менее безопасны при использовании на общедоступном веб-сервере.<hr>
	Локальные куки не работают за пределами папки форума, поэтому, если ваш форум находится, к примеру, по адресу www.myserver.com/forum, страницы типа www.myserver.com/index.php не смогут получить доступ к информации учётной записи.
	Глобальное хранение особенно рекомендуется при использовании SSI.php.';
$helptxt['enableBBC'] = 'Включение этой опции позволит пользователям использовать ББ-код на форуме, для вставки изображений, форматирования текста и многого другого.';
$helptxt['time_offset'] = 'Не все администраторы хотят, чтобы форум использовал то же время, которое используется на сервере. Используя эту функцию, можно указать разницу во времени (в часах).';
$helptxt['default_timezone'] = 'Временная зона сервера указывает PHP, где сервер находится. Убедитесь, что этот параметр установлен корректно, соответственно стране и городу установки сервера. Дополнительная информация на сайте <a href="http://www.php.net/manual/en/timezones.php" target="_blank">PHP</a>.';
$helptxt['spamWaitTime'] = 'Здесь можно указать время, которое необходимо подождать для отправки следующего сообщения. Это может предотвратить спам, флуд или оффтопик на вашем форуме.';

$helptxt['enablePostHTML'] = 'Это позволит использовать HTML-теги в сообщениях пользователей:
	<ul class="normallist" style="margin-bottom: 0;">
		<li>&lt;b&gt;, &lt;u&gt;, &lt;i&gt;, &lt;s&gt;, &lt;em&gt;, &lt;ins&gt;, &lt;del&gt;</li>
		<li>&lt;a href=&quot;&quot;&gt;</li>
		<li>&lt;img src=&quot;&quot; alt=&quot;&quot; /&gt;</li>
		<li>&lt;br /&gt;, &lt;hr /&gt;</li>
		<li>&lt;pre&gt;, &lt;blockquote&gt;</li>
	</ul>';

$helptxt['themes'] = 'Здесь можно выбрать тему оформления, которая будет использоваться по умолчанию.
	Нажмите на тему, чтобы изменить её настройки.';
$helptxt['theme_install'] = 'Здесь можно установить новую тему оформления. Вы можете установить её из уже существующей директории на сервере, загрузить с сайта, либо скопировать уже существующую тему и внести в её код нужные изменения.<br><br>Архив с темой или директория должны содержать файл <tt>theme_info.xml</tt>.';
$helptxt['enableEmbeddedFlash'] = 'Эта функция позволит пользователям встраивать Flash-приложения в свои сообщения.
	Используйте на свой страх и риск!';
$helptxt['xmlnews_enable'] = 'Позволить пользователям ссылаться на <a href="%s?action=.xml;sa=news">Последние новости.</a>
	Рекомендуется ограничить размер сообщений/новостей, для правильного отображения RSS-новостей в разных клиентах.';
$helptxt['globalCookies'] = 'Использование кросс-доменных куки. Например, если...<br>
	Ваш сайт расположен по адресу http://www.example.com/,<br>
	А ваш форум http://forum.example.com/,<br>
	Используя эту функцию, пользователи могут заходить на ваш сайт, используя кросс-доменные куки вашего форума. Не применяйте эту функцию, если используются какие-то другие домены (Например, hacker.portamx.com), которые не принадлежат вам.';
$helptxt['globalCookiesDomain'] = 'При использовании независимых (глобальных) куки, вы можете указать, какой домен должен использоваться для них. Разумеется, нужно указывать свой основной домен — например, если форум находится по адресу <em>forum.example.com</em>, в качестве основного домена необходимо указать <em>www.example.com</em>. Приставку <em>http://</em> указывать не нужно.';
$helptxt['secureCookies'] = 'Включение этой опции отметит все созданные для пользователей куки-файлы как безопасные. Используйте эту функцию только при наличии HTTPS-протокола на вашем сервере!';
$helptxt['securityDisable'] = '<em>Отключение</em> дополнительной проверки пароля при входе в панель администрирования. Не рекомендуется!';
$helptxt['securityDisable_why'] = 'Ваш текущий пароль. (который используется для входа на форум.)<br><br>Необходимость его ввода обусловлена тем, что изменяются некоторые важные настройки и что изменяете их именно <strong>вы</strong>, а не кто либо другой.';
$helptxt['securityDisable_moderate'] = '<em>Отключает</em> дополнительную проверку пароля для страницы модерации. Не рекомендуется!';
$helptxt['securityDisable_moderate_why'] = 'Это ваш текущий пароль (используемый для входа на форум).<br><br>Дополнительное подтверждение помогает убедиться, что вы уверены в своих действиях, собираясь модерировать что-либо, а также что это именно <strong>вы</strong>, а не кто-то другой.';
$helptxt['frame_security'] = 'Современные браузеры понимают заголовок безопасности, предоставляемый серверами под названием X-Frame-Options. Устанавливая эту опцию, вы указываете поведение вашего сайта внутри набора фреймов или фрейма (iframe). Вариант «Разрешить все» не будет отправлять какие-либо заголовки и является наиболее небезопасным, однако позволяет большую свободу. Вариант «Блокировать все» предотвратит все фреймы полностью и является наиболее строгим и безопасным. Вариант «Разрешить со своего домена» позволит вашему домену выдавать любые фреймы и обеспечивает золотую середину для двух предыдущих вариантов.';
$helptxt['proxy_ip_header'] = 'Это заголовок сервера, которому ваш форум будет доверять для хранения IP-адреса реальных пользователей. Изменение этого параметра может привести к неожиданным результатам IP-проверок участников. Перед изменением этих настроек обратитесь к администратору сервера, поставщику CDN или прокси-администратору. Большинство провайдеров понимают и используют заголовок HTTP_X_FORWARDED_FOR. Необходимо заполнить список серверов, отправляющих обратные заголовки прокси для обеспечения безопасности, чтобы эти заголовки поступали только из допустимых источников.';
$helptxt['email_members'] = 'В этом сообщении можно использовать несколько «переменных»:<br>
	{$board_url} - URL-адрес форума.<br>
	{$current_time} - Текущее время.<br>
	{$member.email} - Электронная почта текущего пользователя.<br>
	{$member.link} - Ссылка на профиль текущего пользователя.<br>
	{$member.id} - Идентификатор текущего пользователя.<br>
	{$member.name} - Имя текущего пользователя.<br>
	{$latest_member.link} - Ссылка на профиль последнего зарегистрировавшегося пользователя.<br>
	{$latest_member.id} - Идентификатор последнего зарегистрировавшегося пользователя.<br>
	{$latest_member.name} - Имя последнего зарегистрировавшегося пользователя.';

$helptxt['failed_login_threshold'] = 'Установите количество неудачных попыток входа, после чего произойдет перенаправление на восстановление пароля.';
$helptxt['loginHistoryDays'] = 'Количество дней для хранения истории входа в систему при отслеживании профиля пользователя. Значение по умолчанию — 30 дней.';
$helptxt['oldTopicDays'] = 'Если эта функция включена, форум оповестит пользователя о том, что тема уже устарела и предложит начать новую тему, если он будет пытаться ответить в нее.';
$helptxt['edit_wait_time'] = 'Количество секунд, в течение которых пользователь сможет отредактировать только что отправленное им сообщение, в котором не будет написано, что сообщение отредактировано.';
$helptxt['edit_disable_time'] = 'Количество минут, в течение которых пользователь сможет отредактировать свое сообщение. 0 &mdash; отключить. <br><br><em>Примечание: Если у пользователя есть право редактировать любые сообщения, это ограничение на него не распространяется.</em>';
$helptxt['preview_characters'] = 'Этот параметр задает количество доступных символов для предварительного просмотра первой и последней темы сообщения.';
$helptxt['posts_require_captcha'] = 'Эта функция заставит пользователей вводить проверочный код при публикации каждого сообщения. Ввод кода обязателен для всех пользователей с количеством сообщений меньше заданного &mdash; это должно помочь в борьбе с рассылкой возможного спама.';
$helptxt['enableSpellChecking'] = 'Включить проверку орфографии. У вас ДОЛЖНА быть установлена библиотека pspell или enchant. Ваш сервер ' . ((function_exists('pspell_new') || function_exists('enchant_broker_init')) ? 'ПОДДЕРЖИВАЕТ' : 'НЕ ПОДДЕРЖИВАЕТ') . ' эту функцию.';
$helptxt['disable_wysiwyg'] = 'Эта опция отключает для всех пользователей возможность использовать редактор WYSIWYG при создании сообщений.';
$helptxt['lastActive'] = 'Количество минут, в течение которых пользователь будет считаться находящимся онлайн. По умолчанию &mdash; 15.';

$helptxt['customoptions'] = 'В этом разделе определены параметры, которые пользователь может выбирать из выпадающего списка. Есть несколько ключевых моментов, на которые стоит обратить внимание:
	<ul class="normallist">
		<li><strong>Параметр по умолчанию:</strong> Этот параметр будет выбран изначально.</li>
		<li><strong>Удаление параметров:</strong> Для удаления любого параметра просто очистите его текстовое поле.</li>
		<li><strong>Изменение порядка параметров:</strong> Можно изменить порядок параметров, перемещая текст между блоками. Но помните &mdash; необходимо убедиться, что в результате данной операции текст <strong>не</strong> изменился.</li>
	</ul>';

$helptxt['autoFixDatabase'] = 'Эта функция автоматически исправит ошибки в таблицах базы данных. После завершения работы функции вы получите письмо с уведомлением.';

$helptxt['enableParticipation'] = 'Если в теме содержатся сообщения пользователя, просматривающего раздел, то внутри иконок слева от соответствующей темы появится специальный значок (смайлик &mdash; в стандартном наборе).';

$helptxt['db_persist'] = 'Оставлять соединение активным для улучшения производительности форума. Если не используете выделенный сервер, с этой функцией могут возникнуть проблемы.';
$helptxt['ssi_db_user'] = 'Необязательный параметр: использование разных имени пользователя (для базы данных) и пароля при работе с SSI.php.';

$helptxt['queryless_urls'] = 'Эта опция меняет формат URL-адреса на укороченный, после чего адреса выглядят примерно так: index.php/topic,1.0.html. Такие ссылки могут неверно обрабатываться некоторыми системами, поэтому не рекомендуются к использованию.
Эта опция ' . (isset($_SERVER['SERVER_SOFTWARE']) && (strpos($_SERVER['SERVER_SOFTWARE'], 'Apache') !== false || strpos($_SERVER['SERVER_SOFTWARE'], 'lighttpd') !== false) ? '' : 'НЕ') . ' работает на вашем сервере.';
$helptxt['minimize_files'] = 'Эта опция минимизирует все css и js файлы, которые загружаются каждый раз для каждого пользователя, уменьшая количество запросов на ваш сервер. Новые файлы создаются заново каждый день, если вы хотите пересоздать их, просто очистите кэш форума.';
$helptxt['countChildPosts'] = 'Включение этой функции означает, что сообщения, расположенные в подразделах родительского раздела, будут учитываться в общей статистике форума.';
$helptxt['allow_ignore_boards'] = 'Включение этой функции позволит пользователям выбирать разделы, которые они хотели бы игнорировать.';
$helptxt['deny_boards_access'] = 'Включение этой функции позволит запретить доступ к определенным разделам на основе прав доступа.';
$helptxt['avatars_on_boardIndex'] = 'Включение этой функции отобразит аватары пользователей на индексных страницах разделов и тем.';

$helptxt['who_enabled'] = 'Эта опция позволяет пользователям просматривать, кто в данный момент находится на форуме и чем он занимается.';

$helptxt['recycle_enable'] = '«Восстановление» удаленных тем и сообщений из специального раздела.';

$helptxt['enableReportPM'] = 'Эта опция позволяет пользователям делать рапорт о личных сообщениях администрации форума.';
$helptxt['max_pm_recipients'] = 'Эта опция позволяет установить максимальное количество получателей разрешенные в отсылке личных сообщений пользователем форума. Это может использоваться как предотвращение использования системы личных сообщений для рассылки спама. Обратите внимание что пользователи которым разрешено делать объявления не подвергаются этому ограничению. Без ограничений &mdash; установите 0.';
$helptxt['pm_posts_verification'] = 'Данная настройка заставит пользователей вводить код, отображаемый на изображении, каждый раз при отправке личного сообщения. Пользователи, имеющие определенное количество сообщений не будут вводить код &mdash; это должно помочь в борьбе с автоматическими рассылками спама.';
$helptxt['pm_posts_per_hour'] = 'Это ограничит количество личных сообщений отсылаемых в течение одного часа. Это не затрагивает администраторов и модераторов.';

$helptxt['default_personal_text'] = 'Текст по умолчанию, который будет отображаться под аватарами пользователей.';

$helptxt['registration_method'] = 'Эта опция определяет метод регистрации на вашем форуме. Доступны следующие методы:<br><br>
	<ul class="normallist">
		<li>
			<strong>Регистрация запрещена</strong><br>
			Означает, что никто не может регистрироваться на форуме.<br>
		</li>
		<li>
			<strong>Мгновенная регистрация</strong><br>
			Означает, что, сразу после регистрации, новые пользователи могут войти на форум и оставлять сообщения.<br>
		</li>
		<li>
			<strong>Активация пользователя</strong><br>
			Означает, что пользователь должен активировать свою учётную запись &mdash; путем перехода по ссылке, присланной по электронной почте.<br>
		</li>
		<li>
			<strong>Одобрение администратором</strong><br>
			Означает, что администратор форума должен одобрить учётную запись, прежде чем пользователь будет иметь доступ к основным функциям форума.
		</li>
	</ul>';

$helptxt['send_validation_onChange'] = 'Эта функция означает то, что после смены пользователем его электронного адреса на новый адрес отправляется письмо, с помощью которого пользователь должен реактивировать свою учётную запись.';
$helptxt['approveAccountDeletion'] = 'Если этот параметр включен, любой запрос пользователя на удаление собственной учетной записи должен быть одобрен администратором';

$helptxt['requireAgreement'] = 'Соглашение отображается при регистрации пользователя на форуме и должно быть принято, прежде чем пользователи могут продолжить регистрацию.';
$helptxt['send_welcomeEmail'] = 'При включении этой функции, пользователи, прошедшие регистрацию, будут получать пригласительное письмо с форума.';
$helptxt['password_strength'] = 'Эта функция определяет политику паролей пользователей.
	Доступны следующие варианты:
	<ul class="normallist">
		<li><strong>Низкое:</strong> Пароль должен содержать как минимум 4 символа.</li>
		<li><strong>Среднее:</strong> Пароль должен содержать как минимум 8 символов и не может совпадать с именем или адресом электронной почты.</li>
		<li><strong>Высокое:</strong> Пароль должен содержать символы верхнего и нижнего регистров и как минимум из одного числа.</li>
	</ul>';
$helptxt['enable_password_conversion'] = 'При включении этого параметра PortaMx Forum попытается обнаружить пароли, сохраненные в других форматах и преобразовать их в формат, используемый PortaMx Forum. Обычно это используется для форумов, преобразованных в форум PortaMx, но может иметь и другие применения. Отключение этого параметра предотвращает вход пользователей в систему с использованием пароля после преобразования, и им потребуется сбросить пароль.';

$helptxt['coppaAge'] = 'Значение в этом поле определяет минимальный возраст пользователя на форуме.
	Во время регистрации пользователю будет предложено подтвердить его возраст и, если он подходит под определенное правило, пользователь сможет продолжить регистрацию.
	Если значение равно нулю, возраст учитываться не будет.';
$helptxt['coppaType'] = 'Если на форуме стоит учет возраста и возраст пользователя меньше чем определено в настройках регистрации, существуют два дальнейших действия, а именно:
	<ul class="normallist">
		<li>
			<strong>Отменить регистрацию</strong><br>
			Дальнейшая регистрация пользователя невозможна.<br>
		</li>
		<li>
			<strong>Запросить подтверждение у родителей/опекуна</strong><br>
			Будет отправлено письмо родителям/опекунам пользователя.
		</li>
	</ul>';
$helptxt['coppaPost'] = 'Введите в это поле адрес электронной почты, куда родители/опекуны смогут отправить подтверждение о разрешении на регистрацию.';

$helptxt['allow_hideOnline'] = 'Эта функция позволяет пользователям, которые не являются администраторами, скрывать свой онлайн-статус на форуме.';
$helptxt['meta_keywords'] = 'Эти слова выводятся в теге meta keywords и служат подсказкой для поисковых систем, объясняя им, чему именно посвящен ваш форум и что на нем можно найти. Можно указать довольно большой список слов, разделяя их запятыми (и не используя HTML).';

$helptxt['latest_themes'] = 'Здесь отображаются последние и самые популярные темы оформления с сайта <a href="http://www.portamx.com/" target="_blank">www.portamx.com</a>.  Если темы не отображаются, форум не может подключиться к серверу <a href="http://www.portamx.com/" target="_blank">www.portamx.com</a>.';

$helptxt['secret_why_blank'] = 'В целях безопасности, ответ на секретный вопрос (так же как и пароль) хранится в зашифрованном виде.';
$helptxt['moderator_why_missing'] = 'Так как, модераторы назначаются в конкретные разделы, Вы можете назначить их с помощью <a href="%1$s?action=admin;area=manageboards" target="_blank" class="new_win">интерфейса управления разделами</a>.';

$helptxt['permissions'] = 'Права доступа ограничивают или разрешают пользователям или группе пользователей пользоваться определенными функциями на форуме.';
$helptxt['permissions_board'] = 'Если для раздела выбран режим \'Глобальный\', это означает, что в нем не определены какие-либо собственные права доступа. \'Локальный\' раздел, напротив, использует собственные права доступа, которые отличаются от глобальных прав. Это позволяет создавать разделы с индивидуальными правами, отличающимися от прав остальных разделов.';
$helptxt['permissions_quickgroups'] = 'Эта функция позволяет использовать уже предустановленные наборы прав. Например, \'стандартный\', \'ограниченный\' &mdash; запрещающий, \'модератор\' &mdash; с правами модератора, \'технический\' &mdash; с правами на профилактику.';
$helptxt['permissions_deny'] = 'Эта функция позволяет использовать запрещающие права для пользователей. Можно добавить группу с запрещающими правами для отдельных (избранных) пользователей.<br><br>Используйте данную функцию осторожно.';
$helptxt['permissions_postgroups'] = 'Эта функция позволяет выставить определенные права для групп пользователей, основанных на количестве сообщений.';
$helptxt['membergroup_guests'] = 'В группу «Гости» входят пользователи, не зарегистрированные или не авторизовавшиеся на форуме.';
$helptxt['membergroup_regular_members'] = 'Обычные пользователи это все пользователи, которые вошли на форум, но не входят ни в одну из определенных групп пользователей.';
$helptxt['membergroup_administrator'] = 'Администратор имеет доступ к любой функции форума. Изменить права доступа администратору нельзя.';
$helptxt['membergroup_moderator'] = 'Группа «Модератор» &mdash; специальная группа пользователей, наделенных особыми правами. Чаще всего модератор отвечает за соблюдение пользователями правил сайта. Точный перечень полномочий и обязанностей модератора на каждом сайте свой, но чаще всего полномочия, присвоенные этой группе, применяются к модераторам только <em>в тех разделах, которые они модерируют</em>. За пределами этих разделов модераторы являются такими же пользователями, как и все остальные.';
$helptxt['membergroups'] = 'Существует два вида групп пользователей:
	<ul class="normallist">
		<li><strong>Постоянная группа:</strong> В постоянную группу, пользователи автоматически не заносятся. Для того чтобы поместить пользователя в такую группу, администратор форума должен установить необходимую группу в профиле пользователя.</li>
		<li><strong>Группа основанная на сообщениях:</strong> В отличии от постоянной группы, группа основанная на сообщениях не может быть присвоена администратором пользователю. Пользователи автоматически переходят из группы в группу, набирая необходимое количество сообщений.</li>
	</ul>';

$helptxt['calendar_how_edit'] = 'Вы можете редактировать события, путем нажатия на красную звездочку (*).';

$helptxt['maintenance_members'] = 'Здесь можно <strong>окончательно</strong> и <strong>бесповоротно</strong> удалить учётные записи пользователей форума. <strong>Категорически</strong> рекомендуется сначала сделать резервную копию базы данных, чтобы быть уверенными что не удалите чего-то лишнего.<br><br>Используйте осторожно.';

$helptxt['avatar_server_stored'] = 'Здесь можно позволить пользователям выбирать аватары из хранящихся на сервере. Они, как правило, расположены в том же месте, что и PortaMx Forum в директории для аватаров.<br> Подсказка: если вы создадите поддиректории в директории аватаров, получатся «категории».';
$helptxt['avatar_external'] = 'Если данная опция включена, пользователи смогут указывать прямые URL-адреса на аватары, которые хотят использовать. Однако помните, что слишком большие аватары могут разрушить шаблон вашего форума, приведя к искажению его внешнего вида.';
$helptxt['avatar_download_external'] = 'Эта функция позволяет скачивать аватары с указанных URL-адресов.';
$helptxt['avatar_action_too_large'] = 'Этот параметр позволяет отклонять слишком большие изображения (с других сайтов) или указывать браузеру пользователя изменять их размер, или загружать их на сервер.<br><br>Если пользователи помещают очень большие изображения в качестве аватаров и изменяют размер в браузере, это может привести к очень медленной загрузке этих аватаров для других пользователей - так как размер файла на самом деле не изменяется, файл лишь отображается в уменьшенном виде. Например, цифровая фотография будет загружена полностью, а затем изменена только при отображении - то есть для пользователей просмотр такой фотографии может забрать всю пропускную способность сети.<br><br>С другой стороны, загрузка этих файлов приведет к использованию пропускной способности и пространства сервера, но вы также гарантируете, что изображения будут меньше, поэтому для пользователей это должно быть быстрее. (Примечание: для загрузки и изменения размеров файлов требуется библиотека GD или ImageMagick с помощью расширений Imagick или MagickWand)';
$helptxt['avatar_upload'] = 'Эта опция напоминает параметр «Разрешить пользователям использовать внешние аватары», за тем исключением, что аватары будут загружаться на сервер и уменьшаться согласно выставленным вами настройкам.<br><br>Слишком большое количество аватаров приведет к заметному увеличению занятого пространства, так что используйте эту опцию осторожно.';
$helptxt['avatar_download_png'] = 'Формат PNG, как правило, занимает больше места, но изображения выглядят качественней. Если функция выключена, будет использоваться формат JPEG (Размер файлов меньше, но и качество ниже).';

$helptxt['disableHostnameLookup'] = 'Это отключит запрос имени хоста пользователя. На некоторых серверах эта функция работает медленно. Не забывайте, что функция Бана может стать менее эффективной, так как вы могли поставить бан именно на имя хоста.';

$helptxt['search_weight_frequency'] = 'Здесь можно установить релевантность поиска.<br><br>При выборе опции &quot;Релевантность поиска по количеству сообщений в теме&quot; определяется процент отсеивания сообщений, максимум из которых будут составлять темы, в которых имеется максимальное количество ответов, содержащих искомое слово или фразу.';
$helptxt['search_weight_age'] = 'При выборе варианта &quot;Релевантность поиска по возрасту последних сообщений&quot; Вы определяете процент отсеивания сообщений, первыми из которых будут составлять темы, с последними по времени сообщениями, в которых имеется искомое слово или фраза.';
$helptxt['search_weight_length'] = 'При выборе варианта &quot;Релевантность поиска по величине темы&quot; определяется процент отсеивания сообщений, первыми из которых будут составлять темы, с максимальным количеством сообщений, в которых имеется искомое слово или фраза.';
$helptxt['search_weight_subject'] = 'При выборе варианта &quot;Релевантность поиска по названию темы сообщений&quot; определяется процент отсеивания сообщений, первыми из которых будут составлять темы, в названии которых будет содержаться искомое слово или фраза.';
$helptxt['search_weight_first_message'] = 'При выборе варианта &quot;Релевантность поиска по содержащимся первым сообщениям&quot; определяется процент отсеивания тем, в первых сообщениях которых будет содержаться искомое слово или фраза.';
$helptxt['search_weight_sticky'] = 'Параметры релевантности используются для того чтобы определить уместность результатов поиска. Измените параметры релевантности, чтобы результаты поиска соответствовали важным вещам для вашего форума. К примеру, новости форума могут иметь высокую важность для релевантности по \'возрасту последнего сообщения\'. Все параметры относительно друг друга должны быть целыми положительными числами..<br><br> Этот параметр следит за прикрепленными темами и увеличивает релевантность.';
$helptxt['search'] = 'Здесь производится настройка всех параметров функции поиска.';
$helptxt['search_why_use_index'] = 'Индексирование может намного улучшить работу поиска на вашем форуме. Особенно, когда число сообщений увеличивается, поиск без индексирования занимает больше времени и увеличивает нагрузку на вашу базу данных. Если ваш форум содержит более пятидесяти тысяч сообщений, можно создать индексирование чтобы уменьшить нагрузку на форум.<br><br>Обратите внимание, индексирование может занимать некоторое место. Полнотекстовое индексирование построено на MySQL-индексировании. Это относительно компактно (приблизительно тот же размер что и таблица с сообщениями), но большинство слов не индексируется, и большинство запросов обрабатываются очень медленно. Выборочное индексирование зачастую занимает больше места (в зависимости от ваших настроек может доходить до 3-х кратного размера таблицы с сообщениями), но это намного быстрее чем полнотекстовое и намного стабильнее.';

$helptxt['see_admin_ip'] = 'IP-адреса показываются администраторам и модераторам. Помните, что IP периодически меняются.<br><br>Пользователи могут видеть собственные IP-адреса.';
$helptxt['see_member_ip'] = 'Ваш IP-адрес будет виден только вам и модераторам.  Помните, что IP периодически меняется.<br><br>Вы не можете видеть IP-адреса других пользователей, а они не могут видеть ваш.';
$helptxt['whytwoip'] = 'PortaMx Forum использует различные методы для обнаружения IP-адресов пользователей. Как правило, оба метода приводят к отображению одного и того же адреса, однако в некоторых случаях может обнаружиться даже несколько адресов. В этом случае в журнал записываются оба адреса и в дальнейшем их можно использовать для отслеживания и бана определенных пользователей.';

$helptxt['ban_cannot_post'] = '&quot;Нельзя оставлять сообщения&quot; означает, что пользователь может только просматривать форум и не может оставлять в темах свои ответы или создавать новые темы.';

$helptxt['posts_and_topics'] = '
	<ul class="normallist">
		<li>
			<strong>Настройка отправки сообщений</strong><br>
			Изменение некоторых настроек, касающихся отправки сообщений. Здесь можно включить проверку орфографии.
		</li>
		<li>
			<strong>ББ-теги</strong><br>
			Здесь можно выбрать доступные пользователям теги.
		</li>
		<li>
			<strong>Нецензурные слова</strong>
			Для очистки форума от нецензурных выражений воспользуйтесь этой функцией. Выбранные слова будут заменены на указанные вами.
		</li>
		<li>
			<strong>Настройки тем</strong>
			Изменение настроек тем. Количество отображаемых тем на странице, включение или выключение прикрепленных тем, количество сообщений для определения темы как популярной или очень популярной&nbsp;и&nbsp;т.&nbsp;д.
		</li>
	</ul>';

$helptxt['spider_mode'] = 'Устанавливает уровень отслеживания.<br>
Стандартный - Регистрирует минимальную активность пауков.<br>
Высокий - Предоставляет более точную статистику.<br>
Очень высокий - Такой же, как &quot;Высокий&quot; но регистрирует данные о каждой посещенной странице.';

$helptxt['spider_group'] = 'При выборе группы для пауков, когда гость определяется в качестве поискового робота, ему будут автоматически присвоены определенные &quot;запреты&quot; этой группы, в добавление к обычным правам для гостей. Вы можете использовать это для ограничения поисковых роботов при их посещении вашего форума. Можно, например, создать новую группу под названием &quot;Пауки&quot;, задать для нее ряд запрещающих параметров (просмотр профилей&nbsp;и&nbsp;т.&nbsp;п.) и выбрать её здесь.<br>Примечание: механизм обнаружения пауков не совершенен и не всегда срабатывает, особенно для тех поисковых систем, которые пока не добавлены.';
$helptxt['show_spider_online'] = 'С помощью этого параметра можно выбрать, кому будут видны пауки (их имена, количество) в &quot;списке пользователей онлайн&quot;. Доступные варианты:
	<ul class="normallist">
		<li>
			<strong>Ни для кого</strong><br>
			Пауки будут отображаться в виде обычных гостей.
		</li><li>
			<strong>Показывать количество пауков</strong><br>
			На главной странице будет отображено текущее количество находящихся на форуме пауков.
		</li><li>
			<strong>Показывать детали о пауках</strong><br>
			Имя каждого паука будет доступно для просмотра любому пользователю, на главной странице и на странице &quot;Кто онлайн&quot;.
		</li><li>
			<strong>Показывать всю инфу, но только админам</strong><br>
			Как указано выше, только администраторы могут видеть статус пауков &mdash; всем остальным пользователям пауки будут представляться в виде гостей.
		</li>
	</ul>';

$helptxt['birthday_email'] = 'Выберите шаблон поздравительного сообщения с Днём рождения, который будет использоваться при отправке поздравлений пользователям. В двух полях ниже будут показаны тема сообщения и его текст.<br><strong>Примечание:</strong> Выбор того или иного варианта данного параметра не включает автоматическую рассылку поздравлений. Для этого необходимо зайти в <a href="%1$s?action=admin;area=scheduledtasks;%3$s=%2$s" target="_blank" rel="noopener" class="new_win">Диспетчер задач</a> и убедиться, что задание &quot;Отправление поздравлений с Днем рождения&quot; включено.';
$helptxt['pm_bcc'] = 'При отправке личного сообщения можно добавить скрытого адресата, который не будет виден остальным адресатам сообщения.';

$helptxt['move_topics_maintenance'] = 'Это позволит переместить все сообщения из одного раздела в другой.';
$helptxt['maintain_reattribute_posts'] = 'Вы можете использовать данную функцию для присвоения сообщений гостей определенным зарегистрированным пользователям форума. Это полезно, если, к примеру, какой-нибудь пользователь сначала удалил свою учётную запись, а потом пожалел о содеянном и попросил вернуть ему все его старые сообщения.';
$helptxt['chmod_flags'] = 'Вы можете вручную установить нужные права доступа для выделенных файлов. Для этого введите CHMOD значение (в виде трехзначного числа). Примечание: на Windows-системах это не будет иметь никакого эффекта.';

$helptxt['postmod'] = 'В этой секции модераторы (с достаточным набором прав) могут одобрять любые сообщения и темы перед их публикацией на форуме.';

$helptxt['field_show_enclosed'] = 'Помещает форму для ввода текста пользователем между некоторым текстом или HTML. Это добавляет больше свободы при вводе сообщений, изображений или любых других встраиваемых объектов. Например:<br><br>
		&lt;a href="http://website.com/{INPUT}"&gt;&lt;img src="{DEFAULT_IMAGES_URL}/icon.gif" alt="{INPUT}" /&gt;&lt;/a&gt;<br><br>
		Можно использовать следующие переменные:<br>
		<ul class="normallist">
			<li>{INPUT} &mdash; Данные, вводимые пользователем.</li>
			<li>{SCRIPTURL} &mdash; Веб-адрес форума.</li>
			<li>{IMAGES_URL} &mdash; URL-адрес папки изображений текущей темы оформления.</li>
			<li>{DEFAULT_IMAGES_URL} &mdash; URL-адрес папки изображений темы оформления по умолчанию (default).</li>
		</ul>';

$helptxt['custom_mask'] = 'Маска ввода важна для безопасности вашего форума. Проверка при вводе пользователями данных может помочь предотвращению использования этих данных неожиданным для вас образом. В маске используются простые регулярные выражения.<br><br>
	<div class="smalltext" style="margin: 0 2em">
		&quot;[A-Za-z]+&quot; &mdash; Соответствие всем символам алфавита в верхнем и нижнем регистрах.<br>
		&quot;[0-9]+&quot; &mdash; Соответствие всем числовым символам.<br>
		&quot;[A-Za-z0-9]{7}&quot; &mdash; Соответствие всем символам алфавита в верхнем и нижнем регистрах, а также семизначным числовым значениям.<br>
		&quot;[^0-9]?&quot; &mdash; Запрет любого соответствия числовым значениям.<br>
		&quot;^([A-Fa-f0-9]{3}|[A-Fa-f0-9]{6})$&quot; &mdash; Разрешать только 3 или 6-символьные шестнадцатеричные коды.<br>
	</div><br><br>
	Кроме того, могут быть определены специальные метасимволы ?+*^$ и {xx}.
	<div class="smalltext" style="margin: 0 2em">
		? &mdash; Одно соответствие предыдущему выражению.<br>
		+ &mdash; Одно или более соответствий предыдущему выражению.<br>
		* &mdash; Ни одного соответствия предыдущему выражению.<br>
		{xx} &mdash; Точное число из предыдущего выражения.<br>
		{xx,} &mdash; Точное число или больше из предыдущего выражения.<br>
		{,xx} &mdash; Точное число или меньше из предыдущего выражения.<br>
		{xx,yy} &mdash; Точное соответствие между двумя числами из предыдущего выражения.<br>
		^ &mdash; Начало строки.<br>
		$ &mdash; Конец строки.<br>
		\\ &mdash; Экранирует следующий символ.<br>
	</div><br><br>
	Дополнительную информацию по данному вопросу можно найти в интернете.';

$helptxt['topic_move_any'] = 'Если этот флажок установлен, пользователям будет разрешено перемещать темы в любой доступный раздел. В противном случае они смогут перемещать их только в разделы, где они могут публиковать новые темы.';

$helptxt['alert_pm_new'] = 'Уведомления о новых личных сообщениях не отображаются на панели оповещений, но отображаются в списке «Мои сообщения».';
$helptxt['alert_event_new'] = 'При добавлении нового события в календаре будет отправлено предупреждение или электронное письмо по запросу. Тем не менее, если это событие уже опубликовано и добавлена соответствующая тема, вы не получите предупреждение, если подписаны на данный раздел — уведомления раздела будут в приоритете.';

$helptxt['force_ssl'] = '<strong>Проверьте работоспособность SSL и HTTPS на вашем сервере, прежде чем включать эту опцию, иначе форум может стать недоступным.</strong> Задействуйте режим техобслуживания, если не можете получить доступ к форуму после активации данной опции';
$helptxt['image_proxy_enabled'] = 'Требуется для встраивания внешних изображений при полном SSL';
$helptxt['image_proxy_secret'] = 'Храните это в секрете, защищает изображения вашего форума от использования на других сайтах. Измените его, чтобы сделать текущие изображения с горячими ссылками бесполезными';
$helptxt['image_proxy_maxsize'] = 'Максимальный размер изображения, кэшируемого прокси-сервером изображений: большие изображения не будут кэшироваться. Кэшированные изображения хранятся в папке кэша PortaMx, поэтому убедитесь в наличии свободного места на сервере.';

$helptxt['sef_enabled'] = '<center><strong>ЧПУ</strong></center><hr><strong>ЧПУ-движок требует поддержки mod_rewrite.</strong><br><br>Файл <strong>.htacces</strong> в корне сайта должен содержать следующие строки:<br>
<strong>RewriteEngine On<br>
RewriteCond %{REQUEST_FILENAME} !-f<br>
RewriteCond %{REQUEST_FILENAME} !-d<br>
RewriteRule ^(.*)$ index.php?sef=$1 [L,QSA]<br>
RewriteBase /subdirectory/</strong></br>
Если форум <strong>не</strong> установлен в поддиректорию, измените на <strong>RewriteBase /</strong><br><br>
Если ЧПУ-движок не включается, проверьте наличие файла <strong>.htaccess</strong> в корне сайта. <strong>Также проверьте, включен ли кэш!</strong>';
$helptxt['sef_lowercase'] = 'При включении все URL-адреса будут переведены в нижний регистр.
	Рекомендуется к включению.';
$helptxt['sef_autosave'] = 'При включении все новые области будут добавляться автоматически.
	Тем не менее, рекомендуется не пользоваться этой опцией и добавлять нужные области вручную.';
$helptxt['sef_spacechar'] = 'Используется вместо пробела в адресах (обычно _ или -).
	Лучше всего указать дефис (<strong>-</strong>). Оставьте пустым для удаления любых пробелов.';
$helptxt['sef_stripchars'] = 'Эти символы будут исключены из адресов. Используйте запятую для разделения.<br><strong>Неправильное изменение может привести к неработоспособности форума.</strong>';
$helptxt['sef_actions'] = 'Список всех стандартных областей вашего форума. В принципе, эта опция не нуждается в изменении, поскольку ЧПУ-движок автоматически добавляет сюда не перечисленные области (если соответствующая опция включена).
	Каждая запись должна отделяться запятой.
	<strong>Неправильное изменение может привести к неработоспособности форума.</strong>';
$helptxt['sef_ignoreactions'] =  'Области, не обрабатываемые ЧПУ-движком. Через запятую.';

?>