<?php
// Version: 1.41; imprint

?>[b]Адрес владельца форума:[/b]
{name}
{street}
{location}
{country}

Электронный адрес: {email}
[hr]
[b]Ответственность за содержание[/b]
Содержание наших страниц было создано с большой тщательностью.
За точность, полноту и актуальность содержания мы не несем никакой ответственности.
Правовым основанием для временного сохранения данных и ведения лог-файлов является ст. 6, абз. 1, лит. f Общего регламента по защите данных ЕС.
Поставщики услуг не обязаны контролировать переданную или сохраненную чужую информацию или расследовать обстоятельства, указывающие на незаконную деятельность.
Обязательства по удалению или блокированию использования информации в соответствии с общими законами остаются в силе.
Ответственность возможна только с даты знания о конкретном нарушении.
После уведомления о таких нарушениях мы немедленно удалим этот контент.

[b]Ответственность за ссылки[/b]
Наш сайт содержит ссылки на внешние, неконтролируемые нами, сайты.
Поэтому мы не можем давать какие-либо гарантии за содержание чужих сайтов.
За содержание чужих сайтов отвечают авторы размещенных там материалов.
Каких-либо нарушений на момент размещения ссылок замечено не было.
Без конкретных доказательств нарушения постоянная проверка страниц, на которые ведут ссылки, является необоснованной.
После уведомления о нарушениях мы немедленно удалим такие ссылки.

[b]Авторское право[/b]
Авторское право на контент, размещенный на нашем сайте, защищается российским законодательством.
Если контент не создан одним из пользователей сайта, а взят с иного источника, то права собственности принадлежат третьим лицам.
Если вам стало известно о нарушении авторских прав, сообщите нам об этом.
После уведомления о нарушениях мы немедленно удалим такое содержание.

[b]Конфиденциальность[/b]
Использование опубликованных контактных данных третьими лицами для отправки нежелательной рекламы и информационных материалов настоящим прямо исключается.
Операторы сайта оставляют за собой право принимать юридические меры в случае нежелательной рекламной информации, такой как спам-рассылка.
