<?php
// Version: 1.41; Post

global $context;

$txt['post_reply'] = 'Ответ';
$txt['message_icon'] = 'Иконка';
$txt['subject_not_filled'] = 'Отсутствует тема сообщения.';
$txt['message_body_not_filled'] = 'Поле сообщения было оставлено пустым.';
$txt['error_fatal_subject_link'] = 'Нельзя использовать ссылки в строке заголовка!';

// Use numeric entities in the below string.
$txt['add_bbc'] = 'Добавить ББ-код';

$txt['disable_smileys'] = 'Отключить смайлы';
$txt['dont_use_smileys'] = 'Не использовать смайлы.';
// Escape any single quotes in here twice.. 'it\'s' -> 'it\\\'s'.
$txt['posted_on'] = 'Отправлено';
$txt['standard'] = 'Стандартная';
$txt['thumbs_up'] = 'Супер';
$txt['thumbs_down'] = 'Плохо';
$txt['exclamation_point'] = 'Обратите внимание';
$txt['question_mark'] = 'Вопрос';
$txt['icon_poll'] = 'Опрос';
$txt['lamp'] = 'Лампа';
$txt['add_smileys'] = 'Добавить смайлы';
$txt['topic_notify_no'] = 'Нет тем с уведомлениями.';
// post_too_long seems unused (duplicate in Errors: error_post_too_long
$txt['post_too_long'] = 'Ваше сообщение слишком длинное, пожалуйста, сделайте его короче и попробуйте снова.';

// Use numeric entities in the below five strings.
$txt['notifyUnsubscribe'] = 'Чтобы отказаться от уведомления из темы, нажмите сюда';

$txt['lock_after_post'] = 'Заблокировать после ответа';
$txt['notify_replies'] = 'Уведомить меня о новых ответах в этой теме.';
$txt['lock_topic'] = 'Заблокировать тему.';
$txt['shortcuts'] = '<strong>подсказка</strong>:<br>нажмите alt+s для отправки или,<br>alt+p для предварительного просмотра сообщения';
$txt['shortcuts_drafts'] = '<strong>подсказка</strong>:<br>нажмите alt+s для отправки,<br>alt+p для предварительного просмотра или,<br>alt+d для сохранения черновика';
$txt['shortcuts_firefox'] = '<strong>подсказка</strong>:<br>нажмите shift+alt+s для отправки или,<br>shift+alt+p для предварительного просмотра сообщения';
$txt['shortcuts_drafts_firefox'] = '<strong>подсказка</strong>:<br>нажмите shift+alt+s для отправки,<br>shift+alt+p для предварительного просмотра или,<br>shift+alt+d для сохранения черновика';
$txt['option'] = 'Вариант';
$txt['reset_votes'] = 'Сбросить счетчик голосов';
$txt['reset_votes_check'] = 'Нажмите сюда, если хотите сбросить счетчик голосов на 0.';
$txt['votes'] = 'голосов';
$txt['attach'] = 'Вложение';
$txt['clean_attach'] = 'Удалить вложение';
$txt['attached'] = 'Вложения';
$txt['allowed_types'] = 'Доступные типы файлов';
$txt['attach_add'] = 'Добавить файлы';
$txt['attach_drop_zone'] = 'Перетащите файлы сюда';
$txt['attach_drop_zone_no'] = 'Ваш браузер не поддерживает загрузку файлов перетаскиванием';
$txt['cant_upload_type'] = 'Вы не можете отправить этот файл. Доступны только следующие типы файлов';
$txt['uncheck_unwatchd_attach'] = 'Снимите пометку с вложений, которые необходимо удалить';
$txt['restricted_filename'] = 'Неправильное имя файла. Пожалуйста, переименуйте файл и попробуйте заново.';
$txt['topic_locked_no_reply'] = 'Внимание! Эта тема заблокирована<br>Ответить в ней могут только администраторы и модераторы.';
$txt['awaiting_approval'] = 'Ожидают одобрения';
$txt['attachment_requires_approval'] = 'Обратите внимание: вложения не будут видны, пока модератор не одобрит их.';
$txt['error_temp_attachments'] = 'Обнаружены прикрепленные, но не опубликованные вложения. Они прикреплены к данному сообщению. Если не хотите публиковать эти вложения, смело <a href="#postAttachment">удаляйте</a> их.';
// Use numeric entities in the below string.
$txt['js_post_will_require_approval'] = 'Уведомление: данное сообщение не будет отображаться, пока модератор его не одобрит.';

$txt['enter_comment'] = 'Оставить комментарий';
// Use numeric entities in the below two strings.
$txt['reported_post'] = 'Сообщение';
$txt['reported_to_mod_by'] = 'от';
$txt['rtm10'] = 'Добавить';
// Use numeric entities in the below four strings.
$txt['report_following_post'] = 'Пожалуйста, обратите внимание на тему «%1$s» от пользователя ';
$txt['reported_by'] = 'Пользователь ';
$txt['board_moderate'] = 'сообщил вам об ответе, который, возможно, необходимо отредактировать. Вы получили это уведомление, так как являетесь модератором раздела';
$txt['report_comment'] = 'Пользователь оставил следующий комментарий';

// Use numeric entities in the below three strings.
$txt['report_profile'] = 'Жалоба на профиль \'%1$s\'';
$txt['reported_profile'] = 'Жалоба от пользователя';
$txt['report_following_user'] = 'Профиль пользователя "%1$s" в %2$s';

$txt['attach_restrict_attachmentPostLimit'] = 'максимальный размер всех файлов — %1$d КБ';
$txt['attach_restrict_attachmentPostLimit_MB'] = 'максимальный размер всех файлов — %1$d МБ';
$txt['attach_restrict_attachmentSizeLimit'] = 'максимальный размер одного файла — %1$d КБ';
$txt['attach_restrict_attachmentSizeLimit_MB'] = 'максимальный размер одного файла — %1$d МБ';
$txt['attach_restrict_attachmentNumPerPostLimit'] = 'максимум вложений в сообщении — %1$d';
$txt['attach_restrictions'] = 'Ограничения:';

$txt['post_additionalopt_attach'] = 'Вложения и другие параметры';
$txt['post_additionalopt'] = 'Вложения и другие параметры';
$txt['sticky_after'] = 'Прикрепить тему.';
$txt['move_after2'] = 'Переместить тему.';
$txt['back_to_topic'] = 'Вернуться в тему после ответа.';
$txt['approve_this_post'] = 'Одобрить данное сообщение';

$txt['retrieving_quote'] = 'Цитирование...';

$txt['post_visual_verification_label'] = 'Проверка';
$txt['post_visual_verification_desc'] = 'Для публикации этого сообщения, пожалуйста, введите код с изображения.';

$txt['poll_options'] = 'Настройки голосования';
$txt['poll_run'] = 'Создать голосование на';
$txt['poll_run_limit'] = '(Оставьте пустым, чтобы не ограничивать срок.)';
$txt['poll_results_visibility'] = 'Отображение результатов';
$txt['poll_results_anyone'] = 'Показать результаты всем.';
$txt['poll_results_voted'] = 'Показать результаты только после того как пользователь проголосовал.';
$txt['poll_results_after'] = 'Показать результаты только после окончания срока голосования.';
$txt['poll_max_votes'] = 'Максимальное количество голосов от одного пользователя';
$txt['poll_do_change_vote'] = 'Разрешить пользователям менять свой голос';
$txt['poll_too_many_votes'] = 'Вы выбрали слишком много вариантов. В этом голосовании можно выбрать только %1$s.';
$txt['poll_add_option'] = 'Добавить вариант';
$txt['poll_guest_vote'] = 'Разрешить гостям голосовать';

$txt['spellcheck_done'] = 'Проверка орфографии закончена.';
$txt['spellcheck_change_to'] = 'Заменить на:';
$txt['spellcheck_suggest'] = 'Варианты:';
$txt['spellcheck_change'] = 'Заменить';
$txt['spellcheck_change_all'] = 'Заменить все';
$txt['spellcheck_ignore'] = 'Пропустить';
$txt['spellcheck_ignore_all'] = 'Пропустить все';

$txt['more_attachments'] = 'Добавить ещё';
// Don't use entities in the below string.
$txt['more_attachments_error'] = 'Извините, вы больше не можете добавлять вложения.';

$txt['more_smileys'] = 'ещё';
$txt['more_smileys_title'] = 'Дополнительные смайлы';
$txt['more_smileys_pick'] = 'Выберите смайл';
$txt['more_smileys_close_window'] = 'Закрыть окно';

$txt['error_new_reply'] = 'Внимание! Пока вы набирали сообщение, в теме появился новый ответ. Возможно, вы захотите изменить свое сообщение.';
$txt['error_new_replies'] = 'Внимание! Пока вы набирали сообщение, в теме появилось несколько новых ответов (%1$d). Возможно, вы захотите изменить свое сообщение.';
$txt['error_new_reply_reading'] = 'Внимание! Пока вы просматривали тему, появился новый ответ. Возможно, вы захотите изменить свое сообщение.';
$txt['error_new_replies_reading'] = 'Внимание! Пока вы просматривали тему, появилось несколько новых ответов (%1$d). Возможно, вы захотите изменить свое сообщение.';

$txt['error_topic_locked'] = 'Внимание! Пока вы набирали сообщение, тема была заблокирована. Включите «Заблокировать тему» в секции «Вложения и другие параметры», если вы не хотите отменить это действие.';
$txt['error_topic_unlocked'] = 'Внимание! Пока вы набирали сообщение, тема была разблокирована. Выключите «Заблокировать тему» в секции «Вложения и другие параметры», если вы не хотите отменить это действие.';
$txt['error_topic_stickied'] = 'Внимание! Пока вы набирали сообщение, тема была прикреплена. Включите «Прикрепить тему» в секции «Вложения и другие параметры», если вы не хотите отменить это действие.';
$txt['error_topic_unstickied'] = 'Внимание! Пока вы набирали сообщение, тема была откреплена. Выключите «Прикрепить тему» в секции «Вложения и другие параметры», если вы не хотите отменить это действие.';

$txt['announce_this_topic'] = 'Отправить объявление об этой теме пользователям:';
$txt['announce_title'] = 'Отправить объявление';
$txt['announce_desc'] = 'Эта форма позволяет отправлять напоминание об этой теме выбранным группам пользователей.';
$txt['announce_sending'] = 'Отправить объявление';
$txt['announce_done'] = 'готово';
$txt['announce_continue'] = 'Продолжить';
$txt['announce_topic'] = 'Объявление темы.';
$txt['announce_regular_members'] = 'Пользователи без группы';

$txt['digest_subject_daily'] = 'Ежедневное обозрение';
$txt['digest_subject_weekly'] = 'Еженедельное обозрение';
$txt['digest_intro_daily'] = 'Ниже список всех действий в отслеживаемых разделах и темах за %1$s сегодня. Чтобы отказаться от уведомления, нажмите сюда.';
$txt['digest_intro_weekly'] = 'Ниже список всех действий в отслеживаемых разделах и темах за %1$s неделю. Чтобы отказаться от уведомления, нажмите сюда.';
$txt['digest_new_topics'] = 'Созданы следующие темы';
$txt['digest_new_topics_line'] = '"%1$s" в "%2$s"';
$txt['digest_new_replies'] = 'В следующих темах появились новые сообщения';
$txt['digest_new_replies_one'] = '1 ответ в "%1$s"';
$txt['digest_new_replies_many'] = '%1$d ответов в "%2$s"';
$txt['digest_mod_actions'] = 'Модераторами производились следующие действия';
$txt['digest_mod_act_sticky'] = '"%1$s" были прикреплены';
$txt['digest_mod_act_lock'] = '"%1$s" были закрыты';
$txt['digest_mod_act_unlock'] = '"%1$s" были открыты';
$txt['digest_mod_act_remove'] = '"%1$s" были удалены';
$txt['digest_mod_act_move'] = '"%1$s" были перенесены';
$txt['digest_mod_act_merge'] = '"%1$s" были объединены';
$txt['digest_mod_act_split'] = '"%1$s" были разделены';

$txt['attach_error_title'] = 'Ошибка загрузки вложений.';
$txt['attach_warning'] = 'Возникла проблема в процессе загрузки <strong>%1$s</strong>.';
$txt['attach_check_nag'] = 'Невозможно продолжить из-за не недогруженного (%1$s).';
$txt['attach_max_total_file_size'] = 'Вы превысили лимит на размер вложений. Суммарный размер вложений в сообщении не может превышать %1$s КБ. Осталось доступно %2$s КБ.';
$txt['attach_max_total_file_size_current'] = 'Вы превысили лимит на размер вложений. Суммарный размер вложений в сообщении не может превышать {currentTotal} КБ. Осталось доступно {currentRemain} КБ. Удалите одно или несколько вложений.';
$txt['attach_max_size_progress'] = 'Суммарный размер вложений в сообщении не может превышать {currentTotal} КБ. Суммарный размер выбранных файлов {currentRemain} КБ.';
$txt['attach_folder_warning'] = 'Папка вложений не обнаружена. Сообщите об этой ошибке администратору.';
$txt['attach_folder_admin_warning'] = 'Неверный путь к папке вложений (%1$s). Исправьте его на странице управления вложениями в админке.';
$txt['attach_limit_nag'] = 'Вы превысили лимит на максимальное количество вложений в сообщении.';
$txt['attach_no_upload'] = 'Возникла проблема из-за которой вложение не может быть загружено';
$txt['attach_remaining'] = '%1$d осталось';
$txt['attach_available'] = '%1$s КБ доступно';
$txt['attach_kb'] = '(%1$s КБ)';
$txt['attach_0_byte_file'] = 'Файл имеет нулевой размер. Сообщите адиминистратору, если это повторяется.';
$txt['attached_files_in_session'] = '<em>Указанные выше файлы были загружены, но не будут вложены в сообщение, пока оно не будет одобрено.</em>';
$txt['attached_file_uploaded'] = 'Вложения успешно загружены!';
$txt['attached_file_delete'] = 'Удалить это вложение';
$txt['attached_file_cannot'] = 'Вы не можете загружать вложения';
$txt['attached_file_deleted'] = 'Вложение удалено.';
$txt['attached_file_deleted_error'] = 'Возникла ошибка при удалении вложения.';
$txt['attached_insertBBC'] = 'Вставить';
$txt['attached_cancelAll'] = 'Отменить все';
$txt['attached_uploadAll'] = 'Загрузить все';
$txt['attached_attachedLeft'] = 'Осталось несколько вложений, загрузите их или отмените перед отправкой сообщения.';


$txt['attach_php_error'] = 'Из-за ошибки вложение не может быть загружено. Сообщите адиминистратору, если это повторяется.';
$txt['php_upload_error_1'] = 'Загружаемый файл превышает лимит заданный в php.ini директивой upload_max_filesize. Свяжитесь с хостером, если вам недоступно изменение этой директивы.';
$txt['php_upload_error_3'] = 'Файл был загружен частично. Эта ошибка связана с PHP. Свяжитесь с хостером, если это повторяется.';
$txt['php_upload_error_4'] = 'Файл не был загружен. Эта ошибка связана с PHP. Свяжитесь с хостером, если это повторяется.';
$txt['php_upload_error_6'] = 'Невозможно сохранить файл. Неверно задана временная папка. Свяжитесь с хостером, если не можете исправить это.';
$txt['php_upload_error_7'] = 'Невозможно записать файл на диск. Эта ошибка связана с PHP. Свяжитесь с хостером, если это повторяется.';
$txt['php_upload_error_8'] = 'PHP модуль остановил загрузку. Эта ошибка связана с PHP. Свяжитесь с хостером, если это повторяется.';
$txt['error_temp_attachments_new'] = 'Есть файлы, которые были вложены в ещё не опубликованное сообщение. Это сообщение должно быть опубликовано перед тем, как вложения будут сохранены или удалены. Можно сделать это <a href="#postAttachment">здесь</a>';
$txt['error_temp_attachments_found'] = 'Найдены файлы, вложенные в другое сообщение, которое ещё не было опубликовано. Желательно не отправлять сообщение, пока эти вложения не удалены или не опубликовано то сообщение.<br>Нажмите <a href="%1$s">здесь</a>, чтобы удалить вложения или <a href="%2$s">здесь</a>, чтобы вернуться к тому сообщению.%3$s';
$txt['error_temp_attachments_lost'] = 'Найдены файлы, вложенные в другое сообщение, которое ещё не было опубликовано. Желательно больше не загружать вложения, пока не удалены эти или не опубликовано то сообщение.<br>Нажмите <a href="%1$s">здесь</a>, чтобы удалить эти вложения.%2$s';
$txt['error_temp_attachments_gone'] = 'Вложения были удалены и вы вернулись на предыдущую страницу';
$txt['error_temp_attachments_flushed'] = 'Имейте в виду: файлы, которые были вложены, но не отправлены, будут удалены.';
$txt['error_topic_already_announced'] = 'Эта тема уже была анонсирована.';

$txt['cant_access_upload_path'] = 'Путь для загрузки вложений недоступен!';
$txt['file_too_big'] = 'Файл слишком большой. Максимальный допустимый размер %1$s KB.';
$txt['attach_timeout'] = 'Вложение не может быть сохранено. Или оно слишком долго загружалось или файл больше чем позволяет загрузить сервер.<br><br>Сообщите администратору.';
$txt['bad_attachment'] = 'Вложение не прошло проверку безопасности и не может быть загружено. Сообщите админстратору.';
$txt['ran_out_of_space'] = 'Папка вложений переполнена. Сообщите администратору.';
$txt['attachments_no_write'] = 'Папка вложений недоступна для записи. Вложение или аватар не могут быть сохранены.';
$txt['attachments_no_create'] = 'Невозможно создать новую папку вложений. Вложение или аватар не могут быть сохранены.';
$txt['attachments_limit_per_post'] = 'Вы не можете загрузить больше чем %1$d вложений в сообщение';

$txt['button_php'] = 'Выделенный код (переключитесь на просмотр источника перед использованием!)';
?>