<?php
// Version: 1.41; Themes

$txt['themeadmin_explain'] = 'Темы оформления отвечают за внешний вид форума. Эти настройки влияют на возможность выбора тем оформления пользователями и гостями форума.';

$txt['theme_allow'] = 'Разрешить пользователям выбирать себе темы оформления.';
$txt['theme_guests'] = 'Сменить по умолчанию';
$txt['theme_select'] = 'выбрать...';
$txt['theme_reset'] = 'Сбросить у каждого на';
$txt['theme_nochange'] = 'Без изменений';
$txt['theme_forum_default'] = 'Тема по умолчанию';

$txt['theme_remove'] = 'Удалить';
$txt['theme_enable'] = 'Включить';
$txt['theme_disable'] = 'Отключить';
$txt['theme_remove_confirm'] = 'Хотите удалить эту тему?';
$txt['theme_enable_confirm'] = 'Хотите включить эту тему?';
$txt['theme_disable_confirm'] = 'Хотите отключить эту тему?';
$txt['theme_confirmed_disabling'] = 'Тема была отключена.';
$txt['theme_confirmed_enabling'] = 'Тема была включена.';
$txt['theme_confirmed_removing'] = 'Тема была удалена.';

$txt['theme_install_file'] = 'Из архива (например, .zip, .tar.gz)';
$txt['theme_install_dir'] = 'Из папки на сервере';
$txt['theme_install_error'] = 'Эта папка не существует или не содержит темы оформления!';
$txt['theme_install_write_error'] = 'Для продолжения папка тем оформления должна иметь права на запись!';
$txt['theme_install_go'] = 'Установить';
$txt['theme_install_new'] = 'Создать копию используемой по умолчанию темы';
$txt['theme_install_new_confirm'] = 'Установить новую тему оформления?';
$txt['theme_install_writable'] = 'Внимание - вы не можете создать или установить новую тему оформления, поскольку папка тем оформления не имеет прав на запись!';
$txt['theme_installed'] = 'Установка удачно завершена';
$txt['theme_installed_message'] = 'установлена.';
$txt['theme_updated_message'] = 'обновлена.';
$txt['theme_install_no_action'] = 'Неверное действие при установке.';
$txt['theme_install_error_title'] = 'Возникла ошибка при установке темы.';
$txt['theme_install_error_file_1'] = 'Загружаемый файл превышает лимит, заданный в директиве upload_max_filesize в php.ini.';
$txt['theme_install_error_file_2'] = 'Загружаемый файл превышает лимит MAX_FILE_SIZE, заданный для формы загрузки.';
$txt['theme_install_error_file_3'] = 'Файл загружен не полностью.';
$txt['theme_install_error_file_4'] = 'Не загружен файл.';
$txt['theme_install_error_file_6'] = 'Не обнаружена временная папка для загрузки.';
$txt['theme_install_error_file_7'] = 'Не удалось записать файл на диск.';
$txt['theme_install_invalid_dir'] = 'Вы не добавили путь для текущей темы, поэтому невозможно установить её по умолчанию.';
$txt['theme_install_already_dir'] = 'Введенное название уже используется другой темой, попробуйте другое.';
$txt['theme_install_invalid_id'] = 'Неверный ID темы.';

$txt['theme_pick'] = 'Выбрать тему оформления...';
$txt['theme_preview'] = 'Просмотреть';
$txt['theme_set'] = 'Использовать эту тему оформления';
$txt['theme_user'] = 'пользователь, использующий эту тему оформления.';
$txt['theme_users'] = 'пользователи, использующие эту тему оформления.';
$txt['theme_pick_variant'] = 'Выберите вариацию';

$txt['theme_edit'] = 'Редактировать тему оформления';
$txt['theme_edit_style'] = 'Изменить файлы стилей (цвета, шрифты, прочее).';
$txt['theme_edit_index'] = 'Изменить шаблон. (шаблон главной страницы)';
$txt['theme_edit_no_save'] = 'Этот файл не может быть сохранен, потому что он не доступен для записи. Убедитесь, что имеются права на запись для всех (chmod 777) или выставите правильные.';
$txt['theme_edit_save'] = 'Сохранить изменения';

$txt['theme_global_description'] = 'Это тема по умолчанию. Это означает, что данная тема применяется для всех пользователей, наряду с другими настройками.';

$txt['theme_url_config'] = 'URL-адрес и настройка темы оформления';
$txt['theme_variants'] = 'Вариации темы оформления';
$txt['theme_options'] = 'Свойства темы оформления';
$txt['actual_theme_name'] = 'Название темы оформления: ';
$txt['actual_theme_dir'] = 'Папка темы оформления: ';
$txt['actual_theme_url'] = 'URL-адрес темы оформления: ';
$txt['actual_images_url'] = 'URL-адрес картинок для темы оформления: ';
$txt['current_theme_style'] = 'Стиль темы оформления: ';

$txt['theme_variants_default'] = 'Вариация темы, выбранная по умолчанию';
$txt['theme_variants_user_disable'] = 'Запретить пользователям выбирать вариацию темы';

$txt['site_slogan'] = 'Девиз сайта';
$txt['site_slogan_desc'] = 'Добавьте здесь свой девиз. Он будет отображаться вместо логотипа PortaMx Forum.';

$txt['enable_random_news'] = 'Включить отображение случайной новости наверху форума';
$txt['show_group_key'] = 'Показывать названия групп на главной странице';
$txt['allow_no_censored'] = 'Разрешить пользователям выключать цензуру';
$txt['who_display_viewing'] = 'Показывать кто просматривает раздел';
$txt['who_display_viewing_off'] = 'Не показывать';
$txt['who_display_viewing_numbers'] = 'Показывать количество пользователей';
$txt['who_display_viewing_names'] = 'Показывать имена пользователей';
$txt['disable_recent_posts'] = 'Запретить последние сообщения';
$txt['enable_single_post'] = 'Разрешить одиночные сообщения';
$txt['enable_multiple_posts'] = 'Разрешить множественные сообщения';
$txt['show_stats_index'] = 'Отображать статистику на главной странице';
$txt['latest_members'] = 'Показывать нового пользователя на главной странице форума';
$txt['news_fader'] = 'Показывать прокрутку новостей на главной странице форума';
$txt['member_list_bar'] = 'Показывать список пользователей на главной странице форума';
$txt['header_logo_url'] = 'URL-адрес изображения логотипа';
$txt['header_logo_url_desc'] = 'Оставьте пустым для отображения названия форума и логотипа по умолчанию.';
$txt['number_recent_posts'] = 'Количество последних сообщений на главной странице форума';

$txt['theme_adding_title'] = 'Получение тем оформления';
$txt['theme_adding'] = 'Попробуйте найти новые темы в соответствующем разделе на сайте PortaMx Forum. Понравившуюся тему можно загрузить на свой компьютер для последующей установки на форум.';

$txt['theme_options_defaults'] = 'Здесь расположены значения для пользователей по умолчанию. Сделанные здесь изменения повлияют только на новых пользователей и гостей.';
$txt['theme_options_title'] = 'Изменить или сбросить значения по умолчанию';

$txt['themeadmin_title'] = 'Оформление';
$txt['themeadmin_description'] = 'Здесь можно изменить настройки тем оформления, установить новые темы, а также изменить параметры отображения тем.';
$txt['themeadmin_admin_desc'] = 'Здесь можно выбрать тему по умолчанию, сбросить выбор пользователей и изменить другие настройки, связанные с темой оформления. Также здесь можно установить новые темы.<br>Не забывайте проверять настройки отображения для выбранных тем оформления.';
$txt['themeadmin_list_desc'] = 'Здесь можно просмотреть список всех установленных на форуме тем оформления, изменить их пути и настройки, либо удалить их.';
$txt['themeadmin_reset_desc'] = 'Ниже расположен интерфейс для изменения пользовательских настроек, зависящих от темы оформления. Вы видите только те темы оформления, которые имеют свой набор настроек. ';
$txt['themeadmin_edit_desc'] = 'Изменение стилей отображения и исходного текста установленных тем оформления. Пользуйтесь документацией для помощи.';

$txt['themeadmin_list_heading'] = 'Обзор настроек установленных тем';
$txt['themeadmin_list_tip'] = 'Настройки разных тем оформления могут отличаться друг от друга. Нажмите на название темы, чтобы изменить её основные параметры.';
$txt['themeadmin_list_theme_dir'] = 'Директория темы (шаблонов)';
$txt['themeadmin_list_invalid'] = '(внимание, путь указан неверно!)';
$txt['themeadmin_list_theme_url'] = 'URL-адрес темы оформления';
$txt['themeadmin_list_images_url'] = 'URL-адрес изображений';
$txt['themeadmin_list_reset'] = 'Изменение URL-адреса и директории с темами';
$txt['themeadmin_list_reset_dir'] = 'Путь к директории с темами';
$txt['themeadmin_list_reset_url'] = 'URL-адрес директории с темами';
$txt['themeadmin_list_reset_go'] = 'Сохранить';

$txt['themeadmin_reset_tip'] = 'Каждая тема оформления может иметь собственные пользовательские настройки, такие как: «быстрый ответ», аватары и подписи, параметры отображения и другие. Здесь можно изменить настройки по умолчанию или сбросить уже установленные.<br><br>Имейте в виду, что некоторые темы оформления могут использовать настройки по умолчанию и не иметь собственных.';
$txt['themeadmin_reset_defaults'] = 'Настройки, принятые по умолчанию для гостей и новых пользователей';
$txt['themeadmin_reset_defaults_current'] = 'установленных настроек.';
$txt['themeadmin_reset_members'] = 'Настройки темы оформления для зарегистрированных пользователей';
$txt['themeadmin_reset_remove'] = 'Удалить все настройки пользователей и использовать настройки по умолчанию';
$txt['themeadmin_reset_remove_current'] = 'пользователей, выставивших собственные настройки.';
// Don't use entities in the below string.
$txt['themeadmin_reset_remove_confirm'] = 'Хотите удалить все настройки для этой темы?-n-Это может привести к исчезновению некоторых полей в профилях пользователей.';
$txt['themeadmin_reset_options_info'] = 'Выставленные ниже опции заменят настройки темы для <em>каждого пользователя</em>. Чтобы изменить какой-либо пункт, выберите «изменить», а затем можете выбрать значение для выбранного пункта. Чтобы использовать настройки по умолчанию, выберите пункт «удалить».  Иначе, можете сохранить уже установленное значение, выбрав пункт «не менять».';
$txt['themeadmin_reset_options_change'] = 'Изменить';
$txt['themeadmin_reset_options_none'] = 'Не менять';
$txt['themeadmin_reset_options_default'] = 'По умолчанию';

$txt['themeadmin_edit_browse'] = 'Обзор шаблонов и файлов этой темы оформления.';
$txt['themeadmin_edit_style'] = 'Изменить стили (CSS) этой темы оформления.';
$txt['themeadmin_edit_copy_template'] = 'Копировать шаблон с темы оформления, на которой он основан.';
$txt['themeadmin_edit_exists'] = 'уже существует';
$txt['themeadmin_edit_do_copy'] = 'копировать';
$txt['themeadmin_edit_copy_warning'] = 'Когда форуму необходим шаблон или языковой файл, отсутствующий в текущей теме оформления, он берется из темы, на которой основан шаблон, или из темы по умолчанию.<br>Если вам нужно изменить шаблон, то лучше не копировать его.';
$txt['themeadmin_edit_copy_confirm'] = 'Хотите скопировать этот шаблон?';
$txt['themeadmin_edit_overwrite_confirm'] = 'Хотите скопировать этот шаблон поверх уже существующей копии?\nВсе сделанные ранее изменения НЕ СОХРАНЯТСЯ!';
$txt['themeadmin_edit_no_copy'] = '<em>(невозможно скопировать)</em>';
$txt['themeadmin_browsing_theme'] = 'Обзор файлов темы: %1$s';
$txt['themeadmin_edit_filename'] = 'Имя файла';
$txt['themeadmin_edit_modified'] = 'Последнее редактирование';
$txt['themeadmin_edit_size'] = 'Размер';
$txt['themeadmin_edit_bytes'] = 'б';
$txt['themeadmin_edit_kilobytes'] = 'КБ';
$txt['themeadmin_edit_error'] = 'Редактируемый файл вызвал следующую ошибку:';
$txt['themeadmin_edit_on_line'] = 'Строка';
$txt['themeadmin_edit_preview'] = 'Предварительный просмотр';
$txt['themeadmin_selectable'] = 'Темы оформления, разрешенные для выбора';
$txt['themeadmin_themelist_link'] = 'Отобразить список тем оформления';
?>